[Killed] Foreach_
Controller/BackendController/AdminMainProductCategoryOverviewControll.php:22:9
     public function renderView(): void
     {
         $mainCategory = $this->productRepository->getAllMainCategorys();
-        foreach ($mainCategory as $row) {
-            $mainCategoryDataSet[$row->mainId] = $row->displayName;
-        }
+        foreach (array() as $row) {
 
         $this->view->addTemplateParameter('mainCategory', $mainCategoryDataSet);
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
Undefined variable $mainCategoryDataSet

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminMainProductCategoryOverviewControll.php:20
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminMainProductCategory

[Killed] MethodCallRemoval
Controller/BackendController/AdminMainProductCategoryOverviewControll.php:26:9
             $mainCategoryDataSet[$row->mainId] = $row->displayName;
         }
 
-        $this->view->addTemplateParameter('mainCategory', $mainCategoryDataSet);
+        
 
         $this->view->setTemplate('productMainCategoryOverviewAdmin.tpl');
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'mainCategory' => Array &1 (
-        1 => 'Jeans'
