[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:42:21
                 $hashedPassword = $userDataFromRepository['hashedPassword'];
                 $passwordIsVerified = $this->userDataValidation->verifyPassword($password, $hashedPassword);
                 if ($passwordIsVerified) {
-                    $this->session->loginUser($userDataFromRepository['id']);
+                    
                     $this->redirect->to('/../../index.php');
                 }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Expectation failed for method name is "loginUser" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:43:21
                 $passwordIsVerified = $this->userDataValidation->verifyPassword($password, $hashedPassword);
                 if ($passwordIsVerified) {
                     $this->session->loginUser($userDataFromRepository['id']);
-                    $this->redirect->to('/../../index.php');
+                    
                 }
             }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Expectation failed for method name is "to" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:47:9
                 }
             }
         }
-        $this->view->addTemplateParameter('message', $this->userDataValidation->getErrors());
+        
         $this->view->setTemplate('login.tpl');
     }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'message' => Array &1 ()
-)

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:48:9
             }
         }
         $this->view->addTemplateParameter('message', $this->userDataValidation->getErrors());
-        $this->view->setTemplate('login.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:117

ERRORS!
Tests: 1, Assertions: 0, E
