[Killed] CastInt
Controller/BackendController/AdminProductOverviewControll.php:20:9
 
     public function renderView(): void
     {
-        $mainId = (int)$_GET['mainId'];
+        $mainId = $_GET['mainId'];
         $productId = (int)$_GET['productId'];
         $_SESSION['mainId'] = $mainId;
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
TypeError: Mock_ProductRepository_d53d4eed::getProductByMainId(): Argument #1 ($mainId) must be of type int, string given, called in /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductOverviewControll.php on line 22

/home/jonathanhemmerling/PhpstormProjec

[Killed] CastInt
Controller/BackendController/AdminProductOverviewControll.php:21:9
     public function renderView(): void
     {
         $mainId = (int)$_GET['mainId'];
-        $productId = (int)$_GET['productId'];
+        $productId = $_GET['productId'];
         $_SESSION['mainId'] = $mainId;
 
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
TypeError: Mock_ProductRepository_f103636c::deleteProductById(): Argument #1 ($productId) must be of type int, string given, called in /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductOverviewControll.php on line 20

/home/jonathanhemmerling/Phps

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:25:13
         $_SESSION['mainId'] = $mainId;
 
         if (isset($_POST['submit'])) {
-            $this->productRepository->deleteProductById($productId);
+            
         }
         $productsFromRepository = $this->productRepository->getProductByMainId($mainId);
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
Expectation failed for method name is "deleteProductById" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Controller/BackendController/AdminProductOverviewControll.php:28:9
             $this->productRepository->deleteProductById($productId);
         }
         $productsFromRepository = $this->productRepository->getProductByMainId($mainId);
-        if(!isset($productsFromRepository)){
+        if (isset($productsFromRepository)) {
             $productsFromRepository = [];
         }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'productDataSet' => Array &1 (
-        12 => 'Jeans 4'

[Killed] Foreach_
Controller/BackendController/AdminProductOverviewControll.php:32:9
             $productsFromRepository = [];
         }
         $productDataSet = [];
-        foreach ($productsFromRepository as $row) {
-            $productDataSet[$row->productId] = $row->displayName;
-        }
+        foreach (array() as $row) {
         $this->view->addTemplateParameter('productDataSet', $productDataSet);
         $this->view->setTemplate('productOverviewAdmin.tpl');
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'productDataSet' => Array &1 (
-        12 => 'Jeans 4'

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:35:9
         foreach ($productsFromRepository as $row) {
             $productDataSet[$row->productId] = $row->displayName;
         }
-        $this->view->addTemplateParameter('productDataSet', $productDataSet);
+        
         $this->view->setTemplate('productOverviewAdmin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'productDataSet' => Array &1 (
-        12 => 'Jeans 4'

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:36:9
             $productDataSet[$row->productId] = $row->displayName;
         }
         $this->view->addTemplateParameter('productDataSet', $productDataSet);
-        $this->view->setTemplate('productOverviewAdmin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductOverviewControllTest.php:47

ERROR
