[Killed] MethodCallRemoval
Controller/BackendController/AdminLoginControll.php:38:21
                 $dbUserPassword = $userDataArray['hashedPassword'];
                 $isPasswordVerified = $this->userValidation->verifyPassword($password, $dbUserPassword);
                 if ($isPasswordVerified) {
-                    $this->session->loginAdmin();
+                    
                     $this->redirect->to('/../../index.php?page=Admin&backend');
                 }
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Expectation failed for method name is "loginAdmin" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminLoginControll.php:39:21
                 $isPasswordVerified = $this->userValidation->verifyPassword($password, $dbUserPassword);
                 if ($isPasswordVerified) {
                     $this->session->loginAdmin();
-                    $this->redirect->to('/../../index.php?page=Admin&backend');
+                    
                 }
             }
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Expectation failed for method name is "to" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminLoginControll.php:43:9
                 }
             }
         }
-        $this->view->addTemplateParameter('errors', $this->userValidation->getErrors());
+        
         $this->view->setTemplate('adminLogin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'errors' => Array &1 ()
-)

[Killed] MethodCallRemoval
Controller/BackendController/AdminLoginControll.php:44:9
             }
         }
         $this->view->addTemplateParameter('errors', $this->userValidation->getErrors());
-        $this->view->setTemplate('adminLogin.tpl');
+        
     }
 
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminLoginControllTest.php:39

ERRORS!
Tests: 1, Asse
