[Killed] CastInt
Controller/BackendController/AdminProductSingleRecordControll.php:19:9
 
     public function renderView(): void
     {
-        $productIdBeforeSubmit = (int)$_GET['productId'];
+        $productIdBeforeSubmit = $_GET['productId'];
         if (isset($_POST['submit'])) {
             $productDataSubmitted = $_POST;
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
TypeError: Mock_ProductRepository_7ae5d54d::getProductByProductId(): Argument #1 ($productId) must be of type int, string given, called in /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductSingleRecordControll.php on line 19

/home/jonathanhemmerli

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:24:13
             $productDataSubmitted = $_POST;
             $productData = $this->productRepository->getProductByProductId($productIdBeforeSubmit);
             $productIdAfterSubmit = $productData->productId;
-            $this->productRepository->editProductById($productIdAfterSubmit, 'displayName', $productDataSubmitted['displayName']);
+            
             $this->productRepository->editProductById($productIdAfterSubmit, 'description', $productDataSubmitted['productDescription']);
             $this->productRepository->editProductByid($productIdAfterSubmit, 'price', $productDataSubmitted['price']);
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:25:13
             $productData = $this->productRepository->getProductByProductId($productIdBeforeSubmit);
             $productIdAfterSubmit = $productData->productId;
             $this->productRepository->editProductById($productIdAfterSubmit, 'displayName', $productDataSubmitted['displayName']);
-            $this->productRepository->editProductById($productIdAfterSubmit, 'description', $productDataSubmitted['productDescription']);
+            
             $this->productRepository->editProductByid($productIdAfterSubmit, 'price', $productDataSubmitted['price']);
         }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:26:13
             $productIdAfterSubmit = $productData->productId;
             $this->productRepository->editProductById($productIdAfterSubmit, 'displayName', $productDataSubmitted['displayName']);
             $this->productRepository->editProductById($productIdAfterSubmit, 'description', $productDataSubmitted['productDescription']);
-            $this->productRepository->editProductByid($productIdAfterSubmit, 'price', $productDataSubmitted['price']);
+            
         }
 
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:35:9
         $productDataSet['productDescription'] = $productFromRepository->description;
         $productDataSet['price'] = $productFromRepository->price;
         $_SESSION['productId'] = $productFromRepository->productId;
-        $this->view->addTemplateParameter('productDataSet', $productDataSet);
+        
         $this->view->setTemplate('productSingleRecordAdmin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
Failed asserting that actual size 0 matches expected size 1.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductSingleRecordControllTest.php:62

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:36:9
         $productDataSet['price'] = $productFromRepository->price;
         $_SESSION['productId'] = $productFromRepository->productId;
         $this->view->addTemplateParameter('productDataSet', $productDataSet);
-        $this->view->setTemplate('productSingleRecordAdmin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductSingleRecordControllTest.php:6
