[Killed] LogicalOr
Controller/BackendController/LoginControll.php:30:9
 
     public function renderView(): void
     {
-        if (isset($_SESSION['userName']) || isset($_SESSION['adminName'])) {
+        if (isset($_SESSION['userName']) && isset($_SESSION['adminName'])) {
             $this->session->logoutUser();
         }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedOut
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedOut
Expectation failed for method name is "logoutUser" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:31:13
     public function renderView(): void
     {
         if (isset($_SESSION['userName']) || isset($_SESSION['adminName'])) {
-            $this->session->logoutUser();
+            
         }
         if (isset($_POST['submit'])) {
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedOut
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedOut
Expectation failed for method name is "logoutUser" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:43:21
                 $dbUserPassword = $userDataArray['hashedPassword'];
                 $isPasswordVerified = $this->userValidation->verifyPassword($password, $dbUserPassword);
                 if ($isPasswordVerified) {
-                    $this->session->loginUser($userDataArray['id']);
+                    
                     $this->redirect->to('/../../index.php');
                 }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Expectation failed for method name is "loginUser" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:44:21
                 $isPasswordVerified = $this->userValidation->verifyPassword($password, $dbUserPassword);
                 if ($isPasswordVerified) {
                     $this->session->loginUser($userDataArray['id']);
-                    $this->redirect->to('/../../index.php');
+                    
                 }
             }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Expectation failed for method name is "to" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:49:9
             }
         }
 
-        $this->view->addTemplateParameter('errors', $this->userValidation->getErrors());
+        
         $this->view->setTemplate('login.tpl');
     }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'errors' => Array &1 ()
-)

[Killed] MethodCallRemoval
Controller/BackendController/LoginControll.php:50:9
         }
 
         $this->view->addTemplateParameter('errors', $this->userValidation->getErrors());
-        $this->view->setTemplate('login.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:78

ERRORS!
Tests: 1, Assertions: 0, Er
