[Killed] CastInt
Controller/BackendController/AdminUserOverviewControll.php:23:9
 
     public function renderView(): void
     {
-        $userId = (int)$_GET['userId'];
+        $userId = $_GET['userId'];
         if (isset($_POST['submit'])){
             $this->userRepository->deleteUserById($userId);
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
TypeError: Mock_UserRepository_94c3e9b3::deleteUserById(): Argument #1 ($userId) must be of type int, string given, called in /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminUserOverviewControll.php on line 19

/home/jonathanhemmerling/PhpstormProjects/shopix_pro

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:25:13
     {
         $userId = (int)$_GET['userId'];
         if (isset($_POST['submit'])){
-            $this->userRepository->deleteUserById($userId);
+            
         }
 
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Expectation failed for method name is "deleteUserById" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Foreach_
Controller/BackendController/AdminUserOverviewControll.php:29:9
         }
 
         $allUsers = $this->userRepository->getAllUsers();
-        foreach ($allUsers as $user) {
-            $this->userDataToDisplay[$user->id] = $user->userName;
-        }
+        foreach (array() as $user) {
         $this->view->addTemplateParameter('userDisplay', $this->userDataToDisplay);
         $this->view->setTemplate('userOverview.tpl');
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'userDisplay' => Array &1 (
-        1 => 'user'

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:32:9
         foreach ($allUsers as $user) {
             $this->userDataToDisplay[$user->id] = $user->userName;
         }
-        $this->view->addTemplateParameter('userDisplay', $this->userDataToDisplay);
+        
         $this->view->setTemplate('userOverview.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'userDisplay' => Array &1 (
-        1 => 'user'

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:33:9
             $this->userDataToDisplay[$user->id] = $user->userName;
         }
         $this->view->addTemplateParameter('userDisplay', $this->userDataToDisplay);
-        $this->view->setTemplate('userOverview.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminUserOverviewControllTest.php:45

ERRORS!
Tes
