[Killed] ConcatOperandRemoval
Model/LoginRepository.php:23:9
     public function findAdminByName(string $userName): array
     {
         $string = "SELECT * FROM admin WHERE userName = ";
-        $string .= '"' . $userName . '"';
+        $string .= '"' . '"';
         foreach ($this->pdo->query($string) as $row) {
             $this->userArray = $row;
killedBy: AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
statusReason: 1) AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
Failed asserting that actual size 0 matches expected size 6.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/LoginRepositoryTest.php:42

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
Model/LoginRepository.php:23:9
     public function findAdminByName(string $userName): array
     {
         $string = "SELECT * FROM admin WHERE userName = ";
-        $string .= '"' . $userName . '"';
+        $string .= $userName . '"' . '"';
         foreach ($this->pdo->query($string) as $row) {
             $this->userArray = $row;
killedBy: AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
statusReason: 1) AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '""' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/LoginRepository.php:19
/home/jonathanhemmerling/Phps

[Killed] Foreach_
Model/LoginRepository.php:24:9
     {
         $string = "SELECT * FROM admin WHERE userName = ";
         $string .= '"' . $userName . '"';
-        foreach ($this->pdo->query($string) as $row) {
-            $this->userArray = $row;
-        }
+        foreach (array() as $row) {
         return $this->userArray;
     }
killedBy: AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
statusReason: 1) AppTest\Model\LoginRepositoryTest::testIfAdminDataIsFound
Failed asserting that actual size 0 matches expected size 6.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/LoginRepositoryTest.php:42

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Model/LoginRepository.php:33:9
     public function findUserByName(string $userName): array
     {
         $string = "SELECT * FROM userData WHERE userName = ";
-        $string .= '"' . $userName . '"';
+        $string .= '"' . '"';
         foreach ($this->pdo->query($string) as $row) {
             $this->userArray = $row;
killedBy: AppTest\Model\LoginRepositoryTest::testIfUserDataIsFound
statusReason: 1) AppTest\Model\LoginRepositoryTest::testIfUserDataIsFound
Failed asserting that actual size 0 matches expected size 24.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/LoginRepositoryTest.php:76

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
Model/LoginRepository.php:33:9
     public function findUserByName(string $userName): array
     {
         $string = "SELECT * FROM userData WHERE userName = ";
-        $string .= '"' . $userName . '"';
+        $string .= $userName . '"' . '"';
         foreach ($this->pdo->query($string) as $row) {
             $this->userArray = $row;
killedBy: AppTest\Model\LoginRepositoryTest::testIfUserDataIsFound
statusReason: 1) AppTest\Model\LoginRepositoryTest::testIfUserDataIsFound
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '""' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/LoginRepository.php:28
/home/jonathanhemmerling/Phpst
