[Killed] LogicalAnd
Controller/BackendController/CreateUserControll.php:30:13
             $confirmPassword = $_POST['confirmPassword'];
             $userNameIsValid = $this->userDataValidation->checkIfNewUserNameIsValid($userName);
             $passwordIsValid = $this->userDataValidation->checkIfPasswordIsValid($password, $confirmPassword);
-            if ($userNameIsValid && $passwordIsValid) {
+            if ($userNameIsValid || $passwordIsValid) {
                 $userDataSet['userName'] = $userName;
                 $userDataSet['firstName'] = $_POST['firstName'];
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
App\Model\UserRepository::addNewUserDataArrayToDb(Array (...)): void was not expected to be called.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/CreateUserControll.php:36
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/Create

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:42:17
                 $userDataSet['email'] = $_POST['email'];
                 $userDataSet['telefonNumber'] = $_POST['telefonNumber'];
                 $userDataSet['hashedPassword'] = $password;
-                $this->userRepository->addNewUserDataArrayToDb($userDataSet);
+                
             }
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsAdded
Expectation failed for method name is "addNewUserDataArrayToDb" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:45:9
                 $this->userRepository->addNewUserDataArrayToDb($userDataSet);
             }
         }
-        $this->view->addTemplateParameter('errors', $this->userDataValidation->getErrors());
+        
         $this->view->setTemplate('createUser.tpl');
     }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
Failed asserting that actual size 0 matches expected size 1.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:63

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:46:9
             }
         }
         $this->view->addTemplateParameter('errors', $this->userDataValidation->getErrors());
-        $this->view->setTemplate('createUser.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:60

ERRORS!
Tests: 1, Asser
