[Killed] MethodCallRemoval
Controller/BackendController/LogoutControll.php:25:9
     public function renderView(): void
     {
         $this->session->logoutUser();
-        $this->view->addTemplateParameter('message', self::logoutMessage);
+        
         $this->view->setTemplate('login.tpl');
     }
killedBy: AppTest\Controller\BackendController\LogoutControllTest::testIfUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\LogoutControllTest::testIfUserIsLoggedOut
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'message' => Array &1 (
-        0 => 'Logout successful!'

[Killed] MethodCallRemoval
Controller/BackendController/LogoutControll.php:26:9
     {
         $this->session->logoutUser();
         $this->view->addTemplateParameter('message', self::logoutMessage);
-        $this->view->setTemplate('login.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\LogoutControllTest::testIfUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\LogoutControllTest::testIfUserIsLoggedOut
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LogoutControllTest.php:30

ERRORS!
Tests: 1, Assertions:
