[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:27:13
         if (isset($_POST['submit'])) {
             $userDataSubmitted = $_POST;
 
-            $this->userRepository->editUserAttributeById($userId, 'userName', $userDataSubmitted['Username']);
+            
             $this->userRepository->editUserAttributeById($userId, 'firstName', $userDataSubmitted['First_Name']);
             $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:28:13
             $userDataSubmitted = $_POST;
 
             $this->userRepository->editUserAttributeById($userId, 'userName', $userDataSubmitted['Username']);
-            $this->userRepository->editUserAttributeById($userId, 'firstName', $userDataSubmitted['First_Name']);
+            
             $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
             $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:29:13
 
             $this->userRepository->editUserAttributeById($userId, 'userName', $userDataSubmitted['Username']);
             $this->userRepository->editUserAttributeById($userId, 'firstName', $userDataSubmitted['First_Name']);
-            $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
+            
             $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
             $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:30:13
             $this->userRepository->editUserAttributeById($userId, 'userName', $userDataSubmitted['Username']);
             $this->userRepository->editUserAttributeById($userId, 'firstName', $userDataSubmitted['First_Name']);
             $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
-            $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
+            
             $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
             $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:31:13
             $this->userRepository->editUserAttributeById($userId, 'firstName', $userDataSubmitted['First_Name']);
             $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
             $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
-            $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
+            
             $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
             $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:32:13
             $this->userRepository->editUserAttributeById($userId, 'lastName', $userDataSubmitted['Last_Name']);
             $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
             $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
-            $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
+            
             $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
             $this->userRepository->editUserAttributeById($userId, 'streetNumber', $userDataSubmitted['Streetnumber']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:33:13
             $this->userRepository->editUserAttributeById($userId, 'country', $userDataSubmitted['Country']);
             $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
             $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
-            $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
+            
             $this->userRepository->editUserAttributeById($userId, 'streetNumber', $userDataSubmitted['Streetnumber']);
             $this->userRepository->editUserAttributeById($userId, 'email', $userDataSubmitted['E-Mail']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:34:13
             $this->userRepository->editUserAttributeById($userId, 'postcode', $userDataSubmitted['Postcode']);
             $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
             $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
-            $this->userRepository->editUserAttributeById($userId, 'streetNumber', $userDataSubmitted['Streetnumber']);
+            
             $this->userRepository->editUserAttributeById($userId, 'email', $userDataSubmitted['E-Mail']);
             $this->userRepository->editUserAttributeById($userId, 'telefonNumber', $userDataSubmitted['Telefonnumber']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:35:13
             $this->userRepository->editUserAttributeById($userId, 'city', $userDataSubmitted['City']);
             $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
             $this->userRepository->editUserAttributeById($userId, 'streetNumber', $userDataSubmitted['Streetnumber']);
-            $this->userRepository->editUserAttributeById($userId, 'email', $userDataSubmitted['E-Mail']);
+            
             $this->userRepository->editUserAttributeById($userId, 'telefonNumber', $userDataSubmitted['Telefonnumber']);
         }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:36:13
             $this->userRepository->editUserAttributeById($userId, 'street', $userDataSubmitted['Street']);
             $this->userRepository->editUserAttributeById($userId, 'streetNumber', $userDataSubmitted['Streetnumber']);
             $this->userRepository->editUserAttributeById($userId, 'email', $userDataSubmitted['E-Mail']);
-            $this->userRepository->editUserAttributeById($userId, 'telefonNumber', $userDataSubmitted['Telefonnumber']);
+            
         }
 
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:50:9
         $this->userDataSet['Streetnumber'] = $userDataFromRepository->streetNumber;
         $this->userDataSet['E-Mail'] = $userDataFromRepository->email;
         $this->userDataSet['Telefonnumber'] = $userDataFromRepository->telefonNumber;
-        $this->view->addTemplateParameter('errors', $this->errors);
+        
         $this->view->addTemplateParameter('userDataSet', $this->userDataSet);
         $this->view->setTemplate('userSingleRecord.tpl');
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
-    'userDataSet' => Array &2 (

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:51:9
         $this->userDataSet['E-Mail'] = $userDataFromRepository->email;
         $this->userDataSet['Telefonnumber'] = $userDataFromRepository->telefonNumber;
         $this->view->addTemplateParameter('errors', $this->errors);
-        $this->view->addTemplateParameter('userDataSet', $this->userDataSet);
+        
         $this->view->setTemplate('userSingleRecord.tpl');
     }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'errors' => Array &1 ()
-    'userDataSet' => Array &2 (

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:52:9
         $this->userDataSet['Telefonnumber'] = $userDataFromRepository->telefonNumber;
         $this->view->addTemplateParameter('errors', $this->errors);
         $this->view->addTemplateParameter('userDataSet', $this->userDataSet);
-        $this->view->setTemplate('userSingleRecord.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/UserSingleRecordControllTest.php:82

ERRORS!
Test
