[Killed] Foreach_
Controller/FrontendController/HomeControll.php:24:9
     public function renderView(): void
     {
         $allMenuCategorys = $this->productRepository->getAllMainCategorys();
-        foreach ($allMenuCategorys as $singleMenuElement) {
-            $this->strForLinks [] = (
-                '<a href="index.php?page=UserProductCategoryOverview&mainId=' . $singleMenuElement->mainId . '">' . $singleMenuElement->displayName . '</a>'
-            );
-        }
+        foreach (array() as $singleMenuElement) {
         $this->view->addTemplateParameter('menu', $this->strForLinks);
         $this->view->setTemplate('home.tpl');
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Error: Typed property App\Controller\FrontendController\HomeControll::$strForLinks must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/FrontendController/HomeControll.php:21
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests
