[Killed] Foreach_
Controller/FrontendController/UserProductCategoryOverviewControll.php:24:9
     {
         $mainId = (int)$_GET['mainId'];
         $productDataSet = $this->productRepository->getProductByMainId($mainId);
-        foreach ($productDataSet as $element) {
-            $this->strForLinks[$element->productId] = $element->displayName;
-        }
+        foreach (array() as $element) {
         $this->view->addTemplateParameter('categoryLink', $this->strForLinks);
         $this->view->setTemplate('productCategoryOverview.tpl');
killedBy: AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'categoryLink' => Array &1 (
-        1 => 'Jeans 1'
