[Killed] CastInt
Controller/FrontendController/UserProductSingleRecordControll.php:22:9
 
     public function renderView(): void
     {
-        $productId = (int)$_GET['productId'];
+        $productId = $_GET['productId'];
         $singleProduct = $this->productRepository->getProductByProductId($productId);
         $strForProductName[] = $singleProduct->displayName . ':';
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
TypeError: Mock_ProductRepository_9fcba7b6::getProductByProductId(): Argument #1 ($productId) must be of type int, string given, called in /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/FrontendController/UserProductSingleRecordControll.php on line 17

/home/jo

[Killed] ConcatOperandRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:24:9
     {
         $productId = (int)$_GET['productId'];
         $singleProduct = $this->productRepository->getProductByProductId($productId);
-        $strForProductName[] = $singleProduct->displayName . ':';
+        $strForProductName[] = $singleProduct->displayName;
         $strForProductDescription[] = $singleProduct->description;
         $strForPrice[] = $singleProduct->price;
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] ConcatOperandRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:24:9
     {
         $productId = (int)$_GET['productId'];
         $singleProduct = $this->productRepository->getProductByProductId($productId);
-        $strForProductName[] = $singleProduct->displayName . ':';
+        $strForProductName[] = ':';
         $strForProductDescription[] = $singleProduct->description;
         $strForPrice[] = $singleProduct->price;
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:27:9
         $strForProductName[] = $singleProduct->displayName . ':';
         $strForProductDescription[] = $singleProduct->description;
         $strForPrice[] = $singleProduct->price;
-        $this->view->addTemplateParameter('productName', $strForProductName);
+        
         $this->view->addTemplateParameter('productDescription', $strForProductDescription);
         $this->view->addTemplateParameter('price', $strForPrice);
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:28:9
         $strForProductDescription[] = $singleProduct->description;
         $strForPrice[] = $singleProduct->price;
         $this->view->addTemplateParameter('productName', $strForProductName);
-        $this->view->addTemplateParameter('productDescription', $strForProductDescription);
+        
         $this->view->addTemplateParameter('price', $strForPrice);
         $this->view->setTemplate('productSingleRecord.tpl');
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
     'productName' => Array &1 (
         0 => 'Jeans 1:'
     )

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:29:9
         $strForPrice[] = $singleProduct->price;
         $this->view->addTemplateParameter('productName', $strForProductName);
         $this->view->addTemplateParameter('productDescription', $strForProductDescription);
-        $this->view->addTemplateParameter('price', $strForPrice);
+        
         $this->view->setTemplate('productSingleRecord.tpl');
     }
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
     'productDescription' => Array &2 (
         0 => 'The first Jeans'
     )

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:30:9
         $this->view->addTemplateParameter('productName', $strForProductName);
         $this->view->addTemplateParameter('productDescription', $strForProductDescription);
         $this->view->addTemplateParameter('price', $strForPrice);
-        $this->view->setTemplate('productSingleRecord.tpl');
+        
     }
 }
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/UserProductSingleRecordC
