[Killed] Assignment
Model/ProductRepository.php:60:9
     public function getProductByMainId(int $mainId): array|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE mainId =" . $mainId;
+        $queryString = "WHERE mainId =" . $mainId;
         $queryString .= " ORDER BY displayName ASC";
         foreach ($this->pdo->query($queryString) as $row) {
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductIsFoundByMainId
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductIsFoundByMainId
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'WHERE mainId =1 ORDER BY displayName ASC' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/Produc

[Killed] Concat
Model/ProductRepository.php:71:9
     public function getProductByProductId(int $productId): ProductsDataTransferObject|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= $productId . "WHERE productId =";
         foreach ($this->pdo->query($queryString) as $row) {
             $dto = $this->productsMapper->mapToProductsDto($row);
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'productId =' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:58
/home

[Killed] Concat
Model/ProductRepository.php:80:9
 
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
-        $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = $column . "UPDATE products SET " . "='" . $stringToChange . "' ";
         $queryString .= "WHERE productId=" . $productId;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'descriptionUPDATE products SET ='editedTEST' WHERE productId=1313' at line 1

/home/jonathanhemmerling/Phpsto

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:80:9
 
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
-        $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = $column . "='" . $stringToChange . "' ";
         $queryString .= "WHERE productId=" . $productId;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'description='editedTEST' WHERE productId=1314' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_pr

[Killed] Assignment
Model/ProductRepository.php:81:9
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
         $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE productId=" . $productId;
+        $queryString = "WHERE productId=" . $productId;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'WHERE productId=1325' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRe

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:81:9
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
         $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE productId=" . $productId;
+        $queryString .= "WHERE productId=";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:67
/hom

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:88:9
     public function deleteProductById(int $productId): void
     {
         $queryString = "DELETE FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= $productId;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfMainCategorysAreFound
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfMainCategorysAreFound
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '1327' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:73
/home/jonathanhemm
