[Killed] Foreach_
Model/UserRepository.php:25:9
     public function getAllUsers(): array
     {
         $queryString = "SELECT * FROM userData";
-        foreach ($this->pdo->query($queryString) as $row) {
-            $dataArray [] = $this->userDataMapper->mapToUserDto($row);
-        }
+        foreach (array() as $row) {
         return $dataArray;
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Undefined variable $dataArray

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:23
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:98

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ArrayOneItem
Model/UserRepository.php:28:9
         foreach ($this->pdo->query($queryString) as $row) {
             $dataArray [] = $this->userDataMapper->mapToUserDto($row);
         }
-        return $dataArray;
+        return count($dataArray) > 1 ? array_slice($dataArray, 0, 1, true) : $dataArray;
     }
 
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => App\Model\Dto\UserDataTransferObject Object (...)
-    1 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:33:9
 
     public function getCurrentUserDataById(int $id): UserDataTransferObject|null
     {
-        $queryString = "SELECT * FROM userData WHERE id=" . $id;
+        $queryString = $id;
         foreach ($this->pdo->query($queryString) as $row) {
             $dataArray = $this->userDataMapper->mapToUserDTO($row);
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
TypeError: PDO::query(): Argument #1 ($query) must be of type string, int given

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:28
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:105

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
Model/UserRepository.php:33:9
 
     public function getCurrentUserDataById(int $id): UserDataTransferObject|null
     {
-        $queryString = "SELECT * FROM userData WHERE id=" . $id;
+        $queryString = "SELECT * FROM userData WHERE id=";
         foreach ($this->pdo->query($queryString) as $row) {
             $dataArray = $this->userDataMapper->mapToUserDTO($row);
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:28
/home/jonathanhemmerling/Ph

[Killed] Foreach_
Model/UserRepository.php:34:9
     public function getCurrentUserDataById(int $id): UserDataTransferObject|null
     {
         $queryString = "SELECT * FROM userData WHERE id=" . $id;
-        foreach ($this->pdo->query($queryString) as $row) {
-            $dataArray = $this->userDataMapper->mapToUserDTO($row);
-        }
+        foreach (array() as $row) {
         if(!isset($dataArray)){
             return null;
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
Attempt to read property "userName" on null

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:121

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Model/UserRepository.php:37:9
         foreach ($this->pdo->query($queryString) as $row) {
             $dataArray = $this->userDataMapper->mapToUserDTO($row);
         }
-        if(!isset($dataArray)){
+        if (isset($dataArray)) {
             return null;
         }
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserDataIsFound
Attempt to read property "userName" on null

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:121

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Model/UserRepository.php:46:9
     public function doesUserDataExists(string $user): bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString .= $user . "userName=\"" . '";';
         foreach ($this->pdo->query($queryString) as $row) {
             $userArray = $this->userDataMapper->mapToUserDTO($row);
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
PDOException: SQLSTATE[42S22]: Column not found: 1054 Unknown column 'UserTest123userName' in 'where clause'

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:40
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:127

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
Model/UserRepository.php:46:9
     public function doesUserDataExists(string $user): bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString .= "userName=\"" . '";';
         foreach ($this->pdo->query($queryString) as $row) {
             $userArray = $this->userDataMapper->mapToUserDTO($row);
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:130

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Model/UserRepository.php:47:9
     {
         $queryString = "SELECT * FROM userData WHERE ";
         $queryString .= "userName=\"" . $user . '";';
-        foreach ($this->pdo->query($queryString) as $row) {
-            $userArray = $this->userDataMapper->mapToUserDTO($row);
-        }
+        foreach (array() as $row) {
         if (!isset($userArray)) {
             return false;
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:130

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Model/UserRepository.php:50:9
         foreach ($this->pdo->query($queryString) as $row) {
             $userArray = $this->userDataMapper->mapToUserDTO($row);
         }
-        if (!isset($userArray)) {
+        if (isset($userArray)) {
             return false;
         }
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:130

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Model/UserRepository.php:51:13
             $userArray = $this->userDataMapper->mapToUserDTO($row);
         }
         if (!isset($userArray)) {
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfCurrentUserExists
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/UserRepositoryTest.php:131

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Assignment
Model/UserRepository.php:59:9
     public function addNewUserDataArrayToDb(array $userDataSet): void
     {
         $queryString = "INSERT INTO userData ";
-        $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
+        $queryString = "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfNewUserIsCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfNewUserIsCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'userName, firstName, lastName, country, postcode, city, street, streetNumber, em' at line 1

/home/jonathanhemmerling/P

[Killed] Concat
Model/UserRepository.php:60:9
     {
         $queryString = "INSERT INTO userData ";
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
-        $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
+        $queryString .= "VALUES ('" . "', " . $userDataSet['userName'];
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:60:9
     {
         $queryString = "INSERT INTO userData ";
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
-        $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
+        $queryString .= "VALUES ('" . $userDataSet['userName'];
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:61:9
         $queryString = "INSERT INTO userData ";
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
-        $queryString .= "'" . $userDataSet['firstName'] . "', ";
+        $queryString .= "'" . $userDataSet['firstName'];
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:61:9
         $queryString = "INSERT INTO userData ";
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
-        $queryString .= "'" . $userDataSet['firstName'] . "', ";
+        $queryString .= $userDataSet['firstName'] . "'" . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Assignment
Model/UserRepository.php:62:9
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
-        $queryString .= "'" . $userDataSet['lastName'] . "', ";
+        $queryString = "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:62:9
         $queryString .= "(userName, firstName, lastName, country, postcode, city, street, streetNumber, email, telefonNumber, hashedPassword) ";
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
-        $queryString .= "'" . $userDataSet['lastName'] . "', ";
+        $queryString .= "'" . "', " . $userDataSet['lastName'];
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:63:9
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
-        $queryString .= "'" . $userDataSet['country'] . "', ";
+        $queryString .= $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Assignment
Model/UserRepository.php:63:9
         $queryString .= "VALUES ('" . $userDataSet['userName'] . "', ";
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
-        $queryString .= "'" . $userDataSet['country'] . "', ";
+        $queryString = "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:64:9
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
-        $queryString .= "'" . $userDataSet['postCode'] . "', ";
+        $queryString .= $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:64:9
         $queryString .= "'" . $userDataSet['firstName'] . "', ";
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
-        $queryString .= "'" . $userDataSet['postCode'] . "', ";
+        $queryString .= $userDataSet['postCode'] . "'" . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:65:9
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
-        $queryString .= "'" . $userDataSet['city'] . "', ";
+        $queryString .= "'" . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:65:9
         $queryString .= "'" . $userDataSet['lastName'] . "', ";
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
-        $queryString .= "'" . $userDataSet['city'] . "', ";
+        $queryString .= "'" . "', " . $userDataSet['city'];
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:66:9
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
-        $queryString .= "'" . $userDataSet['street'] . "', ";
+        $queryString .= "'" . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:66:9
         $queryString .= "'" . $userDataSet['country'] . "', ";
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
-        $queryString .= "'" . $userDataSet['street'] . "', ";
+        $queryString .= "'" . "', " . $userDataSet['street'];
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:67:9
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
-        $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
+        $queryString .= "'" . $userDataSet['streetNumber'];
         $queryString .= "'" . $userDataSet['email'] . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:67:9
         $queryString .= "'" . $userDataSet['postCode'] . "', ";
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
-        $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
+        $queryString .= "'" . "', " . $userDataSet['streetNumber'];
         $queryString .= "'" . $userDataSet['email'] . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:68:9
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
-        $queryString .= "'" . $userDataSet['email'] . "', ";
+        $queryString .= "'" . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
         $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:68:9
         $queryString .= "'" . $userDataSet['city'] . "', ";
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
-        $queryString .= "'" . $userDataSet['email'] . "', ";
+        $queryString .= "'" . $userDataSet['email'];
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
         $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:69:9
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
-        $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
+        $queryString .= $userDataSet['telefonNumber'] . "', ";
         $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
         $this->pdo->query($queryString);
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:69:9
         $queryString .= "'" . $userDataSet['street'] . "', ";
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
-        $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
+        $queryString .= $userDataSet['telefonNumber'] . "'" . "', ";
         $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
         $this->pdo->query($queryString);
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:70:9
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
-        $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
+        $queryString .= "'" . $userDataSet['hashedPassword'];
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Assignment
Model/UserRepository.php:70:9
         $queryString .= "'" . $userDataSet['streetNumber'] . "', ";
         $queryString .= "'" . $userDataSet['email'] . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
-        $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
+        $queryString = "'" . $userDataSet['hashedPassword'] . "');";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)
