[Killed] MethodCallRemoval
Model/UserRepository.php:71:9
         $queryString .= "'" . $userDataSet['email'] . "', ";
         $queryString .= "'" . $userDataSet['telefonNumber'] . "', ";
         $queryString .= "'" . $userDataSet['hashedPassword'] . "');";
-        $this->pdo->query($queryString);
+        
     }
 
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:79:9
         string $column,
         string $stringToChange,
     ): void {
-        $queryString = "UPDATE userData SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = "UPDATE userData SET " . $column . "='" . "' ";
         $queryString .= "WHERE id=" . $id;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Concat
Model/UserRepository.php:79:9
         string $column,
         string $stringToChange,
     ): void {
-        $queryString = "UPDATE userData SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = $column . "UPDATE userData SET " . "='" . $stringToChange . "' ";
         $queryString .= "WHERE id=" . $id;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:80:9
         string $stringToChange,
     ): void {
         $queryString = "UPDATE userData SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE id=" . $id;
+        $queryString .= "WHERE id=";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Assignment
Model/UserRepository.php:80:9
         string $stringToChange,
     ): void {
         $queryString = "UPDATE userData SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE id=" . $id;
+        $queryString = "WHERE id=" . $id;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] MethodCallRemoval
Model/UserRepository.php:81:9
     ): void {
         $queryString = "UPDATE userData SET " . $column . "='" . $stringToChange . "' ";
         $queryString .= "WHERE id=" . $id;
-        $this->pdo->query($queryString);
+        
     }
 
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] PublicVisibility
Model/UserRepository.php:84:5
         $this->pdo->query($queryString);
     }
 
-    public function deleteUserById(int $userId): void
+    protected function deleteUserById(int $userId) : void
     {
         $queryString = "DELETE FROM userData ";
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] ConcatOperandRemoval
Model/UserRepository.php:87:9
     public function deleteUserById(int $userId): void
     {
         $queryString = "DELETE FROM userData ";
-        $queryString .= "WHERE id =" . $userId;
+        $queryString .= $userId;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] Assignment
Model/UserRepository.php:87:9
     public function deleteUserById(int $userId): void
     {
         $queryString = "DELETE FROM userData ";
-        $queryString .= "WHERE id =" . $userId;
+        $queryString = "WHERE id =" . $userId;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)

[Killed] MethodCallRemoval
Model/UserRepository.php:88:9
     {
         $queryString = "DELETE FROM userData ";
         $queryString .= "WHERE id =" . $userId;
-        $this->pdo->query($queryString);
+        
     }
 }
killedBy: AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
statusReason: 1) AppTest\Model\UserRepositoryTest::testIfAllUserDataIsFound
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     1 => App\Model\Dto\UserDataTransferObject Object (...)
     2 => App\Model\Dto\UserDataTransferObject Object (...)
     3 => App\Model\Dto\UserDataTransferObject Object (...)
