[Killed] Identical
Validation/UserDataValidation.php:24:9
 
     public function checkIfNewUserNameIsValid(string $userName): bool
     {
-        if ($userName === '') {
+        if ($userName !== '') {
             $this->errors[] = 'Username cannot be blank';
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:110

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:26:13
     {
         if ($userName === '') {
             $this->errors[] = 'Username cannot be blank';
-            return false;
+            return true;
         }
         if (!$this->hasLength($userName)) {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:111

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:28:9
             $this->errors[] = 'Username cannot be blank';
             return false;
         }
-        if (!$this->hasLength($userName)) {
+        if ($this->hasLength($userName)) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:110

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:30:13
         }
         if (!$this->hasLength($userName)) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
-            return false;
+            return true;
         }
         if (!$this->isAUniqueUserName($userName)) {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:114

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:32:9
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             return false;
         }
-        if (!$this->isAUniqueUserName($userName)) {
+        if ($this->isAUniqueUserName($userName)) {
             $this->errors[] = 'Select another Username';
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:110

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:34:13
         }
         if (!$this->isAUniqueUserName($userName)) {
             $this->errors[] = 'Select another Username';
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:116

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] Identical
Validation/UserDataValidation.php:42:9
     public function checkIfUserNameIsValid(
         string $userName
     ): bool {
-        if ($userName === '' || ((!$this->userExist($userName)))) {
+        if ($userName !== '' || !$this->userExist($userName)) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] LogicalOr
Validation/UserDataValidation.php:42:9
     public function checkIfUserNameIsValid(
         string $userName
     ): bool {
-        if ($userName === '' || ((!$this->userExist($userName)))) {
+        if ($userName === '' && !$this->userExist($userName)) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:68

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:45:13
         if ($userName === '' || ((!$this->userExist($userName)))) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:67

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Identical
Validation/UserDataValidation.php:64:9
 
     public function checkIfPasswordIsValid(string $password, string $confirmPassword): bool
     {
-        if ($password === '') {
+        if ($password !== '') {
         $this->errors[] = 'Password cannot be blank';
         return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:132

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:66:9
     {
         if ($password === '') {
         $this->errors[] = 'Password cannot be blank';
-        return false;
+        return true;
     }
         if ($confirmPassword === '') {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:134

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Identical
Validation/UserDataValidation.php:68:9
         $this->errors[] = 'Password cannot be blank';
         return false;
     }
-        if ($confirmPassword === '') {
+        if ($confirmPassword !== '') {
         $this->errors[] = 'Confirmpassword cannot be blank';
         return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:132

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:70:9
     }
         if ($confirmPassword === '') {
         $this->errors[] = 'Confirmpassword cannot be blank';
-        return false;
+        return true;
     }
         if (strlen($confirmPassword) < 8) {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
App\Model\UserRepository::addNewUserDataArrayToDb(Array (...)): void was not expected to be called.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/CreateUserControll.php:42
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/Create

[Killed] LessThanNegotiation
Validation/UserDataValidation.php:72:9
         $this->errors[] = 'Confirmpassword cannot be blank';
         return false;
     }
-        if (strlen($confirmPassword) < 8) {
+        if (strlen($confirmPassword) >= 8) {
             $this->errors[] = 'Password must be at least 8 characters long';
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:132

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThan
Validation/UserDataValidation.php:72:9
         $this->errors[] = 'Confirmpassword cannot be blank';
         return false;
     }
-        if (strlen($confirmPassword) < 8) {
+        if (strlen($confirmPassword) <= 8) {
             $this->errors[] = 'Password must be at least 8 characters long';
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:132

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:74:13
     }
         if (strlen($confirmPassword) < 8) {
             $this->errors[] = 'Password must be at least 8 characters long';
-            return false;
+            return true;
         }
         if (!password_verify($confirmPassword, $password)) {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:138

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:78:13
         }
         if (!password_verify($confirmPassword, $password)) {
             $this->errors[] = 'Passwords has to be the same';
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfPasswordIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:133

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Validation/UserDataValidation.php:107:9
     private function hasLength(
         string $value
     ): bool {
-        $options = ['min' => 3, 'max' => 20];
+        $options = ['min' => 2, 'max' => 20];
         if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:114

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] IncrementInteger
Validation/UserDataValidation.php:107:9
     private function hasLength(
         string $value
     ): bool {
-        $options = ['min' => 3, 'max' => 20];
+        $options = ['min' => 3, 'max' => 21];
         if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
             return false;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:115

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IncrementInteger
Validation/UserDataValidation.php:108:9
         string $value
     ): bool {
         $options = ['min' => 3, 'max' => 20];
-        if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
+        if (!$this->hasLengthGreaterThan($value, $options['min'] - 2)) {
             return false;
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:114

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Validation/UserDataValidation.php:108:9
         string $value
     ): bool {
         $options = ['min' => 3, 'max' => 20];
-        if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
+        if (!$this->hasLengthGreaterThan($value, $options['min'] - 0)) {
             return false;
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:112

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:109:13
     ): bool {
         $options = ['min' => 3, 'max' => 20];
         if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
-            return false;
+            return true;
         }
         if (!$this->hasLengthLessThan($value, ($options['max'] + 1))) {
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:114

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:111:9
         if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
             return false;
         }
-        if (!$this->hasLengthLessThan($value, ($options['max'] + 1))) {
+        if ($this->hasLengthLessThan($value, $options['max'] + 1)) {
             return false;
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:110

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Plus
Validation/UserDataValidation.php:111:9
         if (!$this->hasLengthGreaterThan($value, $options['min'] - 1)) {
             return false;
         }
-        if (!$this->hasLengthLessThan($value, ($options['max'] + 1))) {
+        if (!$this->hasLengthLessThan($value, $options['max'] - 1)) {
             return false;
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:113

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:112:13
             return false;
         }
         if (!$this->hasLengthLessThan($value, ($options['max'] + 1))) {
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:115

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] Identical
Validation/UserDataValidation.php:133:9
         $userDataExist = false;
         $adminDataArray = $this->login->findAdminByName($value);
         $userDataArray = $this->login->findUserByName($value);
-        if ((isset($userDataArray['userName']) && $userDataArray['userName'] === $value) || (isset($adminDataArray['userName']) && $adminDataArray['userName'] === $value)) {
+        if (isset($userDataArray['userName']) && $userDataArray['userName'] !== $value || isset($adminDataArray['userName']) && $adminDataArray['userName'] === $value) {
             $userDataExist = true;
         }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'message' => Array &1 ()
+    'message' => Array &1 (

[Killed] LogicalOr
Validation/UserDataValidation.php:133:9
         $userDataExist = false;
         $adminDataArray = $this->login->findAdminByName($value);
         $userDataArray = $this->login->findUserByName($value);
-        if ((isset($userDataArray['userName']) && $userDataArray['userName'] === $value) || (isset($adminDataArray['userName']) && $adminDataArray['userName'] === $value)) {
+        if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value && (isset($adminDataArray['userName']) && $adminDataArray['userName'] === $value)) {
             $userDataExist = true;
         }
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIfUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:66

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Validation/UserDataValidation.php:134:13
         $adminDataArray = $this->login->findAdminByName($value);
         $userDataArray = $this->login->findUserByName($value);
         if ((isset($userDataArray['userName']) && $userDataArray['userName'] === $value) || (isset($adminDataArray['userName']) && $adminDataArray['userName'] === $value)) {
-            $userDataExist = true;
+            $userDataExist = false;
         }
         return $userDataExist;
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (
