[Killed] MethodCallRemoval
Controller/BackendController/AdminControll.php:17:9
 
     public function renderView(): void
     {
-        $this->view->setTemplate('admin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminControllTest::testIfTemplateIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminControllTest.php:27

ERRORS!
Tests: 1, Assertions: 0,
