[Killed] PublicVisibility
Controller/BackendController/AdminLogoutControll.php:21:5
     ) {
     }
 
-    public function renderView(): void
+    protected function renderView() : void
     {
         $this->session->logoutUser();
killedBy: AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
Error: Call to protected method App\Controller\BackendController\AdminLogoutControll::renderView() from scope AppTest\Controller\BackendController\AdminLogoutControllTest

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminLogoutControllTest.php:34

[Killed] MethodCallRemoval
Controller/BackendController/AdminLogoutControll.php:23:9
 
     public function renderView(): void
     {
-        $this->session->logoutUser();
+        
         $this->view->addTemplateParameter('errors', self::message);
         $this->view->setTemplate('adminLogin.tpl');
killedBy: AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
Failed asserting that true is not true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminLogoutControllTest.php:41

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminLogoutControll.php:24:9
     public function renderView(): void
     {
         $this->session->logoutUser();
-        $this->view->addTemplateParameter('errors', self::message);
+        
         $this->view->setTemplate('adminLogin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'errors' => Array &1 (
-        0 => 'Logout successful!'

[Killed] MethodCallRemoval
Controller/BackendController/AdminLogoutControll.php:25:9
     {
         $this->session->logoutUser();
         $this->view->addTemplateParameter('errors', self::message);
-        $this->view->setTemplate('adminLogin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
statusReason: 1) AppTest\Controller\BackendController\AdminLogoutControllTest::testIfTemplateIsSetUpAndUserIsLoggedOut
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminLogoutControllTest.php:35

ER
