[Killed] Foreach_
Controller/BackendController/AdminMainProductCategoryOverviewControll.php:22:9
     public function renderView(): void
     {
         $mainCategorys = $this->products->getAllMainCategorys();
-        foreach ($mainCategorys as $row) {
-            $mainCategorysArray[$row->mainId] = $row->displayName;
-        }
+        foreach (array() as $row) {
 
         $this->view->addTemplateParameter('mainCategorys', $mainCategorysArray);
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
Undefined variable $mainCategorysArray

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminMainProductCategoryOverviewControll.php:20
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminMainProductCategoryO

[Killed] MethodCallRemoval
Controller/BackendController/AdminMainProductCategoryOverviewControll.php:26:9
             $mainCategorysArray[$row->mainId] = $row->displayName;
         }
 
-        $this->view->addTemplateParameter('mainCategorys', $mainCategorysArray);
+        
 
         $this->view->setTemplate('productMainCategoryOverviewAdmin.tpl');
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'mainCategorys' => Array &1 (
-        1 => 'Jeans'

[Killed] MethodCallRemoval
Controller/BackendController/AdminMainProductCategoryOverviewControll.php:28:9
 
         $this->view->addTemplateParameter('mainCategorys', $mainCategorysArray);
 
-        $this->view->setTemplate('productMainCategoryOverviewAdmin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminMainProductCategoryOverviewCo
