[Killed] CastInt
Controller/BackendController/AdminProductOverviewControll.php:23:9
 
     public function renderView(): void
     {
-        $this->mainId = (int)$_GET['mainId'];
+        $this->mainId = $_GET['mainId'];
         $this->productId = (int)$_GET['productId'];
         $_SESSION['mainId'] = $this->mainId;
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
TypeError: Cannot assign string to property App\Controller\BackendController\AdminProductOverviewControll::$mainId of type int

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductOverviewControll.php:18
/home/jonathanhemmerling/PhpstormProjects/shopix_proj

[Killed] CastInt
Controller/BackendController/AdminProductOverviewControll.php:24:9
     public function renderView(): void
     {
         $this->mainId = (int)$_GET['mainId'];
-        $this->productId = (int)$_GET['productId'];
+        $this->productId = $_GET['productId'];
         $_SESSION['mainId'] = $this->mainId;
 
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
TypeError: Cannot assign string to property App\Controller\BackendController\AdminProductOverviewControll::$productId of type int

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductOverviewControll.php:19
/home/jonathanhemmerling/PhpstormProjects/shopix_p

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:28:13
         $_SESSION['mainId'] = $this->mainId;
 
         if (isset($_POST['submit'])) {
-            $this->products->deleteProductById($this->productId);
+            
         }
 
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfProductsCanBeDeleted
Expectation failed for method name is "deleteProductById" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Controller/BackendController/AdminProductOverviewControll.php:32:9
         }
 
         $products = $this->products->getProductByMainId($this->mainId);
-        if(!isset($products)){
+        if (isset($products)) {
             $products = [];
         }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'products' => Array &1 (
-        12 => 'Jeans 4'

[Killed] Foreach_
Controller/BackendController/AdminProductOverviewControll.php:36:9
             $products = [];
         }
         $productsArray = [];
-        foreach ($products as $row) {
-            $productsArray[$row->productId] = $row->displayName;
-        }
+        foreach (array() as $row) {
         $this->view->addTemplateParameter('products', $productsArray);
         $this->view->setTemplate('productOverviewAdmin.tpl');
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'products' => Array &1 (
-        12 => 'Jeans 4'

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:39:9
         foreach ($products as $row) {
             $productsArray[$row->productId] = $row->displayName;
         }
-        $this->view->addTemplateParameter('products', $productsArray);
+        
         $this->view->setTemplate('productOverviewAdmin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'products' => Array &1 (
-        12 => 'Jeans 4'

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductOverviewControll.php:40:9
             $productsArray[$row->productId] = $row->displayName;
         }
         $this->view->addTemplateParameter('products', $productsArray);
-        $this->view->setTemplate('productOverviewAdmin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductOverviewControllTest.php:36

ERROR
