[Killed] CastInt
Controller/BackendController/AdminProductSingleRecordControll.php:20:9
 
     public function renderView(): void
     {
-        $this->productId = (int)$_GET['productId'];
+        $this->productId = $_GET['productId'];
         if (isset($_POST['submit'])) {
             $productDataFromForm = $_POST;
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
TypeError: Cannot assign string to property App\Controller\BackendController\AdminProductSingleRecordControll::$productId of type int

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminProductSingleRecordControll.php:17
/home/jonathanhemmerling/PhpstormPr

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:25:13
             $productDataFromForm = $_POST;
             $productData = $this->products->getProductByProductId($this->productId);
             $productId = $productData->productId;
-            $this->products->editProductById($productId, 'displayName', $productDataFromForm['displayName']);
+            
             $this->products->editProductById($productId, 'description', $productDataFromForm['productDescription']);
             $this->products->editProductByid($productId, 'price', $productDataFromForm['price']);
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:26:13
             $productData = $this->products->getProductByProductId($this->productId);
             $productId = $productData->productId;
             $this->products->editProductById($productId, 'displayName', $productDataFromForm['displayName']);
-            $this->products->editProductById($productId, 'description', $productDataFromForm['productDescription']);
+            
             $this->products->editProductByid($productId, 'price', $productDataFromForm['price']);
         }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:27:13
             $productId = $productData->productId;
             $this->products->editProductById($productId, 'displayName', $productDataFromForm['displayName']);
             $this->products->editProductById($productId, 'description', $productDataFromForm['productDescription']);
-            $this->products->editProductByid($productId, 'price', $productDataFromForm['price']);
+            
         }
 
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfProductIsEdited
Expectation failed for method name is "editProductById" when invoked 3 time(s).
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:36:9
         $arrayMain['productDescription'] = $mainCategorys->description;
         $arrayMain['price'] = $mainCategorys->price;
         $_SESSION['productId'] = $mainCategorys->productId;
-        $this->view->addTemplateParameter('productName', $arrayMain);
+        
         $this->view->setTemplate('productSingleRecordAdmin.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
Failed asserting that actual size 0 matches expected size 1.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductSingleRecordControllTest.php:60

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/AdminProductSingleRecordControll.php:37:9
         $arrayMain['price'] = $mainCategorys->price;
         $_SESSION['productId'] = $mainCategorys->productId;
         $this->view->addTemplateParameter('productName', $arrayMain);
-        $this->view->setTemplate('productSingleRecordAdmin.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductSingleRecordControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminProductSingleRecordControllTest.php:5
