[Killed] CastInt
Controller/BackendController/AdminUserOverviewControll.php:23:5
     }
 
     public function renderView(): void
-    {$this->userId = (int)$_GET['userId'];
+    $this->userId = $_GET['userId'];
         if (isset($_POST['submit'])){
             $this->userRepository->deleteUserById($this->userId);
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
TypeError: Cannot assign string to property App\Controller\BackendController\AdminUserOverviewControll::$userId of type int

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminUserOverviewControll.php:18
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:25:13
     public function renderView(): void
     {$this->userId = (int)$_GET['userId'];
         if (isset($_POST['submit'])){
-            $this->userRepository->deleteUserById($this->userId);
+            
         }
 
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Expectation failed for method name is "deleteUserById" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Foreach_
Controller/BackendController/AdminUserOverviewControll.php:29:9
         }
 
         $users = $this->userRepository->getAllUsers();
-        foreach ($users as $user) {
-            $this->userDisplay [$user->id] = $user->userName;
-        }
+        foreach (array() as $user) {
         $this->view->addTemplateParameter('userDisplay', $this->userDisplay);
         $this->view->setTemplate('userOverview.tpl');
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'userDisplay' => Array &1 (
-        1 => 'user'

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:32:9
         foreach ($users as $user) {
             $this->userDisplay [$user->id] = $user->userName;
         }
-        $this->view->addTemplateParameter('userDisplay', $this->userDisplay);
+        
         $this->view->setTemplate('userOverview.tpl');
     }
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'userDisplay' => Array &1 (
-        1 => 'user'

[Killed] MethodCallRemoval
Controller/BackendController/AdminUserOverviewControll.php:33:9
             $this->userDisplay [$user->id] = $user->userName;
         }
         $this->view->addTemplateParameter('userDisplay', $this->userDisplay);
-        $this->view->setTemplate('userOverview.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminUserOverviewControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/AdminUserOverviewControllTest.php:39

ERRORS!
Tes
