[Killed] MethodCallRemoval
Controller/BackendController/CreateProductControll.php:28:13
         $this->mainId = (int)$_GET['mainId'];
         if (isset($_POST['submit'])) {
             $productDataFromForm = $_POST;
-            $this->products->createNewProduct(
-                $this->mainId,
-                $productDataFromForm['displayName'],
-                $productDataFromForm['productName'],
-                $productDataFromForm['description'],
-                $productDataFromForm['price']
-            );
+            
         }
         $this->view->addTemplateParameter('mainId', [$this->mainId]);
killedBy: AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
Expectation failed for method name is "createNewProduct" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/CreateProductControll.php:36:9
                 $productDataFromForm['price']
             );
         }
-        $this->view->addTemplateParameter('mainId', [$this->mainId]);
+        
         $this->view->setTemplate('createProduct.tpl');
     }
killedBy: AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'mainId' => Array &1 (
-        0 => 1

[Killed] MethodCallRemoval
Controller/BackendController/CreateProductControll.php:37:9
             );
         }
         $this->view->addTemplateParameter('mainId', [$this->mainId]);
-        $this->view->setTemplate('createProduct.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateProductControllTest.php:39

ERRORS!
Tests: 1, A
