[Killed] LogicalAnd
Controller/BackendController/CreateUserControll.php:30:13
             $confirmPassword = $_POST['confirmPassword'];
             $isUserNameValid = $this->validation->checkIfNewUserNameIsValid($userName);
             $isPasswordValid = $this->validation->checkIfPasswordIsValid($password, $confirmPassword);
-            if ($isUserNameValid && $isPasswordValid) {
+            if ($isUserNameValid || $isPasswordValid) {
                 $userArray['userName'] = $userName;
                 $userArray['firstName'] = $_POST['firstName'];
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
App\Model\UserRepository::addNewUserDataArrayToDb(Array (...)): void was not expected to be called.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/CreateUserControll.php:36
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/Create

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:42:17
                 $userArray['email'] = $_POST['email'];
                 $userArray['telefonNumber'] = $_POST['telefonNumber'];
                 $userArray['hashedPassword'] = $password;
-                $this->repository->addNewUserDataArrayToDb($userArray);
+                
             }
         }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsAdded
Expectation failed for method name is "addNewUserDataArrayToDb" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:45:9
                 $this->repository->addNewUserDataArrayToDb($userArray);
             }
         }
-        $this->view->addTemplateParameter('errors', $this->validation->getErrors());
+        
         $this->view->setTemplate('createUser.tpl');
     }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
Failed asserting that actual size 0 matches expected size 1.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:56

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/CreateUserControll.php:46:9
             }
         }
         $this->view->addTemplateParameter('errors', $this->validation->getErrors());
-        $this->view->setTemplate('createUser.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateUserControllTest.php:53

ERRORS!
Tests: 1, Asser
