[Killed] CastInt
Controller/BackendController/UserSingleRecordControll.php:25:9
 
     public function renderView(): void
     {
-        $this->userId = (int)$_GET['userId'];
+        $this->userId = $_GET['userId'];
         if (isset($_POST['submit'])) {
             $userDataFromForm = $_POST;
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
TypeError: Cannot assign string to property App\Controller\BackendController\UserSingleRecordControll::$userId of type int

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/UserSingleRecordControll.php:20
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/C

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:29:13
         if (isset($_POST['submit'])) {
             $userDataFromForm = $_POST;
 
-            $this->repository->editUserAttributeById($this->userId, 'userName', $userDataFromForm['Username']);
+            
             $this->repository->editUserAttributeById($this->userId, 'firstName', $userDataFromForm['First_Name']);
             $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:30:13
             $userDataFromForm = $_POST;
 
             $this->repository->editUserAttributeById($this->userId, 'userName', $userDataFromForm['Username']);
-            $this->repository->editUserAttributeById($this->userId, 'firstName', $userDataFromForm['First_Name']);
+            
             $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
             $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:31:13
 
             $this->repository->editUserAttributeById($this->userId, 'userName', $userDataFromForm['Username']);
             $this->repository->editUserAttributeById($this->userId, 'firstName', $userDataFromForm['First_Name']);
-            $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
+            
             $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
             $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:32:13
             $this->repository->editUserAttributeById($this->userId, 'userName', $userDataFromForm['Username']);
             $this->repository->editUserAttributeById($this->userId, 'firstName', $userDataFromForm['First_Name']);
             $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
-            $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
+            
             $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
             $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:33:13
             $this->repository->editUserAttributeById($this->userId, 'firstName', $userDataFromForm['First_Name']);
             $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
             $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
-            $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
+            
             $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
             $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:34:13
             $this->repository->editUserAttributeById($this->userId, 'lastName', $userDataFromForm['Last_Name']);
             $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
             $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
-            $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
+            
             $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
             $this->repository->editUserAttributeById($this->userId, 'streetNumber', $userDataFromForm['Streetnumber']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:35:13
             $this->repository->editUserAttributeById($this->userId, 'country', $userDataFromForm['Country']);
             $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
             $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
-            $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
+            
             $this->repository->editUserAttributeById($this->userId, 'streetNumber', $userDataFromForm['Streetnumber']);
             $this->repository->editUserAttributeById($this->userId, 'email', $userDataFromForm['E-Mail']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:36:13
             $this->repository->editUserAttributeById($this->userId, 'postcode', $userDataFromForm['Postcode']);
             $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
             $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
-            $this->repository->editUserAttributeById($this->userId, 'streetNumber', $userDataFromForm['Streetnumber']);
+            
             $this->repository->editUserAttributeById($this->userId, 'email', $userDataFromForm['E-Mail']);
             $this->repository->editUserAttributeById($this->userId, 'telefonNumber', $userDataFromForm['Telefonnumber']);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:37:13
             $this->repository->editUserAttributeById($this->userId, 'city', $userDataFromForm['City']);
             $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
             $this->repository->editUserAttributeById($this->userId, 'streetNumber', $userDataFromForm['Streetnumber']);
-            $this->repository->editUserAttributeById($this->userId, 'email', $userDataFromForm['E-Mail']);
+            
             $this->repository->editUserAttributeById($this->userId, 'telefonNumber', $userDataFromForm['Telefonnumber']);
         }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:38:13
             $this->repository->editUserAttributeById($this->userId, 'street', $userDataFromForm['Street']);
             $this->repository->editUserAttributeById($this->userId, 'streetNumber', $userDataFromForm['Streetnumber']);
             $this->repository->editUserAttributeById($this->userId, 'email', $userDataFromForm['E-Mail']);
-            $this->repository->editUserAttributeById($this->userId, 'telefonNumber', $userDataFromForm['Telefonnumber']);
+            
         }
 
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Expectation failed for method name is "editUserAttributeById" when invoked 10 time(s).
Method was expected to be called 10 times, actually called 9 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:52:9
         $this->userDataSet['Streetnumber'] = $userData->streetNumber;
         $this->userDataSet['E-Mail'] = $userData->email;
         $this->userDataSet['Telefonnumber'] = $userData->telefonNumber;
-        $this->view->addTemplateParameter('changedUser', $this->changedUser);
+        
         $this->view->addTemplateParameter('errors', $this->errors);
         $this->view->addTemplateParameter('items', $this->userDataSet);
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'changedUser' => Array &1 ()
-    'errors' => Array &2 ()

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:53:9
         $this->userDataSet['E-Mail'] = $userData->email;
         $this->userDataSet['Telefonnumber'] = $userData->telefonNumber;
         $this->view->addTemplateParameter('changedUser', $this->changedUser);
-        $this->view->addTemplateParameter('errors', $this->errors);
+        
         $this->view->addTemplateParameter('items', $this->userDataSet);
         $this->view->setTemplate('userSingleRecord.tpl');
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'changedUser' => Array &1 ()
-    'errors' => Array &2 ()

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:54:9
         $this->userDataSet['Telefonnumber'] = $userData->telefonNumber;
         $this->view->addTemplateParameter('changedUser', $this->changedUser);
         $this->view->addTemplateParameter('errors', $this->errors);
-        $this->view->addTemplateParameter('items', $this->userDataSet);
+        
         $this->view->setTemplate('userSingleRecord.tpl');
     }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'changedUser' => Array &1 ()
     'errors' => Array &2 ()

[Killed] MethodCallRemoval
Controller/BackendController/UserSingleRecordControll.php:55:9
         $this->view->addTemplateParameter('changedUser', $this->changedUser);
         $this->view->addTemplateParameter('errors', $this->errors);
         $this->view->addTemplateParameter('items', $this->userDataSet);
-        $this->view->setTemplate('userSingleRecord.tpl');
+        
     }
 }
killedBy: AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
statusReason: 1) AppTest\Controller\BackendController\UserSingleRecordControllTest::testIsFormSubmitted
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/UserSingleRecordControllTest.php:50

ERRORS!
Test
