[Killed] Foreach_
Controller/FrontendController/HomeControll.php:24:9
     public function renderView(): void
     {
         $allMenuCategorys = $this->mainMenuRepository->getAllMainCategorys();
-        foreach ($allMenuCategorys as $singleMenuElement) {
-            $this->strForLinks [] = (
-                '<a href="index.php?page=UserProductCategoryOverview&mainId=' . $singleMenuElement->mainId . '">' . $singleMenuElement->displayName . '</a>'
-            );
-        }
+        foreach (array() as $singleMenuElement) {
         $this->view->addTemplateParameter('menu', $this->strForLinks);
         $this->view->setTemplate('home.tpl');
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Error: Typed property App\Controller\FrontendController\HomeControll::$strForLinks must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/FrontendController/HomeControll.php:21
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests

[Killed] ConcatOperandRemoval
Controller/FrontendController/HomeControll.php:26:17
         $allMenuCategorys = $this->mainMenuRepository->getAllMainCategorys();
         foreach ($allMenuCategorys as $singleMenuElement) {
             $this->strForLinks [] = (
-                '<a href="index.php?page=UserProductCategoryOverview&mainId=' . $singleMenuElement->mainId . '">' . $singleMenuElement->displayName . '</a>'
+                $this->strForLinks[] = '<a href="index.php?page=UserProductCategoryOverview&mainId=' . '">' . $singleMenuElement->displayName . '</a>';
             );
         }
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'menu' => Array &1 (
-        0 => '<a href="index.php?page=UserProductCategoryOverview&mainId=1">Jeans</a>'

[Killed] Concat
Controller/FrontendController/HomeControll.php:26:17
         $allMenuCategorys = $this->mainMenuRepository->getAllMainCategorys();
         foreach ($allMenuCategorys as $singleMenuElement) {
             $this->strForLinks [] = (
-                '<a href="index.php?page=UserProductCategoryOverview&mainId=' . $singleMenuElement->mainId . '">' . $singleMenuElement->displayName . '</a>'
+                $this->strForLinks[] = $singleMenuElement->mainId . '<a href="index.php?page=UserProductCategoryOverview&mainId=' . '">' . $singleMenuElement->displayName . '</a>';
             );
         }
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'menu' => Array &1 (
-        0 => '<a href="index.php?page=UserProductCategoryOverview&mainId=1">Jeans</a>'

[Killed] MethodCallRemoval
Controller/FrontendController/HomeControll.php:29:9
                 '<a href="index.php?page=UserProductCategoryOverview&mainId=' . $singleMenuElement->mainId . '">' . $singleMenuElement->displayName . '</a>'
             );
         }
-        $this->view->addTemplateParameter('menu', $this->strForLinks);
+        
         $this->view->setTemplate('home.tpl');
     }
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'menu' => Array &1 (
-        0 => '<a href="index.php?page=UserProductCategoryOverview&mainId=1">Jeans</a>'

[Killed] MethodCallRemoval
Controller/FrontendController/HomeControll.php:30:9
             );
         }
         $this->view->addTemplateParameter('menu', $this->strForLinks);
-        $this->view->setTemplate('home.tpl');
+        
     }
 }
killedBy: AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\HomeControllTest::testIfMainCategorysAreLoadedAndDisplayed
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/HomeControllTest.php:30

ERRORS!
Tests
