[Killed] MethodCallRemoval
Controller/FrontendController/NotFoundControll.php:21:9
 
     public function renderView(): void
     {
-        $this->view->addTemplateParameter('error', self::error);
+        
         $this->view->setTemplate('notFound.tpl');
     }
killedBy: AppTest\FrontendController\NotFoundControllTest::testIfArrayIsLoaded
statusReason: 1) AppTest\FrontendController\NotFoundControllTest::testIfArrayIsLoaded
Failed asserting that actual size 0 matches expected size 1.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/NotFoundControllTest.php:27

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/FrontendController/NotFoundControll.php:22:9
     public function renderView(): void
     {
         $this->view->addTemplateParameter('error', self::error);
-        $this->view->setTemplate('notFound.tpl');
+        
     }
 }
killedBy: AppTest\FrontendController\NotFoundControllTest::testIfArrayIsLoaded
statusReason: 1) AppTest\FrontendController\NotFoundControllTest::testIfArrayIsLoaded
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/NotFoundControllTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Erro
