[Killed] Foreach_
Controller/FrontendController/UserProductCategoryOverviewControll.php:25:9
     {
         $this->mainId = (int)$_GET['mainId'];
         $listContent = $this->products->getProductByMainId($this->mainId);
-        foreach ($listContent as $listElement) {
-            $this->strForLinks[$listElement->productId] = $listElement->displayName;
-        }
+        foreach (array() as $listElement) {
         $this->view->addTemplateParameter('categoryLink', $this->strForLinks);
         $this->view->setTemplate('productCategoryOverview.tpl');
killedBy: AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'categoryLink' => Array &1 (
-        1 => 'Jeans 1'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductCategoryOverviewControll.php:28:9
         foreach ($listContent as $listElement) {
             $this->strForLinks[$listElement->productId] = $listElement->displayName;
         }
-        $this->view->addTemplateParameter('categoryLink', $this->strForLinks);
+        
         $this->view->setTemplate('productCategoryOverview.tpl');
     }
killedBy: AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 (
-    'categoryLink' => Array &1 (
-        1 => 'Jeans 1'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductCategoryOverviewControll.php:29:9
             $this->strForLinks[$listElement->productId] = $listElement->displayName;
         }
         $this->view->addTemplateParameter('categoryLink', $this->strForLinks);
-        $this->view->setTemplate('productCategoryOverview.tpl');
+        
     }
 }
killedBy: AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductCategoryOverViewControllTest::testIfMainCategorysAreLoadedAndDisplayed
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/UserProductCate
