[Killed] ConcatOperandRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:30:9
     {
         $this->productId = (int)$_GET['productId'];
         $singleProduct = $this->products->getProductByProductId($this->productId);
-        $this->strForProductName[] = $singleProduct->displayName . ':';
+        $this->strForProductName[] = ':';
         $this->strForProductDescription[] = $singleProduct->description;
         $this->strForPrice[] = $singleProduct->price;
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] ConcatOperandRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:30:9
     {
         $this->productId = (int)$_GET['productId'];
         $singleProduct = $this->products->getProductByProductId($this->productId);
-        $this->strForProductName[] = $singleProduct->displayName . ':';
+        $this->strForProductName[] = $singleProduct->displayName;
         $this->strForProductDescription[] = $singleProduct->description;
         $this->strForPrice[] = $singleProduct->price;
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
     'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:33:9
         $this->strForProductName[] = $singleProduct->displayName . ':';
         $this->strForProductDescription[] = $singleProduct->description;
         $this->strForPrice[] = $singleProduct->price;
-        $this->view->addTemplateParameter('productName', $this->strForProductName);
+        
         $this->view->addTemplateParameter('productDescription', $this->strForProductDescription);
         $this->view->addTemplateParameter('price', $this->strForPrice);
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'productName' => Array &1 (
-        0 => 'Jeans 1:'

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:34:9
         $this->strForProductDescription[] = $singleProduct->description;
         $this->strForPrice[] = $singleProduct->price;
         $this->view->addTemplateParameter('productName', $this->strForProductName);
-        $this->view->addTemplateParameter('productDescription', $this->strForProductDescription);
+        
         $this->view->addTemplateParameter('price', $this->strForPrice);
         $this->view->setTemplate('productSingleRecord.tpl');
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
     'productName' => Array &1 (
         0 => 'Jeans 1:'
     )

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:35:9
         $this->strForPrice[] = $singleProduct->price;
         $this->view->addTemplateParameter('productName', $this->strForProductName);
         $this->view->addTemplateParameter('productDescription', $this->strForProductDescription);
-        $this->view->addTemplateParameter('price', $this->strForPrice);
+        
         $this->view->setTemplate('productSingleRecord.tpl');
     }
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
     'productDescription' => Array &2 (
         0 => 'The first Jeans'
     )

[Killed] MethodCallRemoval
Controller/FrontendController/UserProductSingleRecordControll.php:36:9
         $this->view->addTemplateParameter('productName', $this->strForProductName);
         $this->view->addTemplateParameter('productDescription', $this->strForProductDescription);
         $this->view->addTemplateParameter('price', $this->strForPrice);
-        $this->view->setTemplate('productSingleRecord.tpl');
+        
     }
 }
killedBy: AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
statusReason: 1) AppTest\Controller\FrontendController\UserProductSingleRecordControllTest::testIfProductsAreLoadedAndDisplayed
Error: Typed property App\Core\View::$template must not be accessed before initialization

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Core/View.php:34
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/FrontendController/UserProductSingleRecordC
