[Killed] Foreach_
Model/ProductRepository.php:37:9
     {
         $queryString = "SELECT * FROM mainCategorys";
         $rows = $this->pdo->query($queryString);
-        foreach ($rows as $row) {
-            $dto [] = ($this->mainMapper->mapToMainDto($row));
-        }
+        foreach (array() as $row) {
         return $dto ?? null;
     }
killedBy: AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminMainProductCategoryOverviewControllTest::testIfArrayIsSetUp
foreach() argument must be of type array|object, null given

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/AdminMainProductCategoryOverviewControll.php:22
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/Admi

[Killed] Foreach_
Model/ProductRepository.php:53:9
     {
         $queryString = "SELECT * FROM products";
         $rows = $this->pdo->query($queryString);
-        foreach ($rows as $row) {
-            $dto [] = ($this->productsMapper->mapToProductsDto($row));
-        }
+        foreach (array() as $row) {
         return $dto ?? null;
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductsAreFound
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductsAreFound
TypeError: count(): Argument #1 ($value) must be of type Countable|array, null given

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/ProductRepositoryTest.php:47

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Model/ProductRepository.php:62:9
     public function getProductByMainId(int $mainId): array|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE mainId =" . $mainId;
+        $queryString .= $mainId . "WHERE mainId =";
         $queryString .= " ORDER BY displayName ASC";
         foreach ($this->pdo->query($queryString) as $row) {
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'mainId = ORDER BY displayName ASC' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:62:9
     public function getProductByMainId(int $mainId): array|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE mainId =" . $mainId;
+        $queryString .= $mainId;
         $queryString .= " ORDER BY displayName ASC";
         foreach ($this->pdo->query($queryString) as $row) {
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '1 ORDER BY displayName ASC' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Mo

[Killed] Assignment
Model/ProductRepository.php:63:9
     {
         $queryString = "SELECT * FROM products ";
         $queryString .= "WHERE mainId =" . $mainId;
-        $queryString .= " ORDER BY displayName ASC";
+        $queryString = " ORDER BY displayName ASC";
         foreach ($this->pdo->query($queryString) as $row) {
             $dto [] = $this->productsMapper->mapToProductsDto($row);
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'ORDER BY displayName ASC' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Mode

[Killed] Foreach_
Model/ProductRepository.php:64:9
         $queryString = "SELECT * FROM products ";
         $queryString .= "WHERE mainId =" . $mainId;
         $queryString .= " ORDER BY displayName ASC";
-        foreach ($this->pdo->query($queryString) as $row) {
-            $dto [] = $this->productsMapper->mapToProductsDto($row);
-        }
+        foreach (array() as $row) {
         return $dto ?? null;
     }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'products' => Array &1 (
-        12 => 'Jeans 4'

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:73:9
     public function getProductByProductId(int $productId): ProductsDataTransferObject|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= "WHERE productId =";
         foreach ($this->pdo->query($queryString) as $row) {
             $dto = $this->productsMapper->mapToProductsDto($row);
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:60
/home/jonathanhe

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:73:9
     public function getProductByProductId(int $productId): ProductsDataTransferObject|null
     {
         $queryString = "SELECT * FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= $productId;
         foreach ($this->pdo->query($queryString) as $row) {
             $dto = $this->productsMapper->mapToProductsDto($row);
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '8' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:60
/home/jonathanh

[Killed] Foreach_
Model/ProductRepository.php:74:9
     {
         $queryString = "SELECT * FROM products ";
         $queryString .= "WHERE productId =" . $productId;
-        foreach ($this->pdo->query($queryString) as $row) {
-            $dto = $this->productsMapper->mapToProductsDto($row);
-        }
+        foreach (array() as $row) {
         return $dto ?? null;
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfProductsAreFoundByProductId
null does not match expected type "object".

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/ProductRepositoryTest.php:59

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Concat
Model/ProductRepository.php:82:9
 
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
-        $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = "UPDATE products SET " . $column . $stringToChange . "='" . "' ";
         $queryString .= "WHERE productid=" . $productId;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42S22]: Column not found: 1054 Unknown column 'descriptioneditedTEST' in 'field list'

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:69
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Model/ProductRepositoryTest.php:73

ERRORS!
Tests

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:82:9
 
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
-        $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
+        $queryString = "UPDATE products SET " . $column . $stringToChange . "' ";
         $queryString .= "WHERE productid=" . $productId;
         $this->pdo->query($queryString);
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' WHERE productid=622' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductR

[Killed] Assignment
Model/ProductRepository.php:83:9
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
         $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE productid=" . $productId;
+        $queryString = "WHERE productid=" . $productId;
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'WHERE productid=630' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRep

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:83:9
     public function editProductById(int $productId, string $column, string $stringToChange): void
     {
         $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
-        $queryString .= "WHERE productid=" . $productId;
+        $queryString .= "WHERE productid=";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:69
/hom

[Killed] MethodCallRemoval
Model/ProductRepository.php:84:9
     {
         $queryString = "UPDATE products SET " . $column . "='" . $stringToChange . "' ";
         $queryString .= "WHERE productid=" . $productId;
-        $this->pdo->query($queryString);
+        
     }
 
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'TEST'
+'editedTEST'

[Killed] Concat
Model/ProductRepository.php:90:9
     public function deleteProductById(int $productId): void
     {
         $queryString = "DELETE FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= $productId . "WHERE productId =";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'productId =' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepo

[Killed] ConcatOperandRemoval
Model/ProductRepository.php:90:9
     public function deleteProductById(int $productId): void
     {
         $queryString = "DELETE FROM products ";
-        $queryString .= "WHERE productId =" . $productId;
+        $queryString .= "WHERE productId =";
         $this->pdo->query($queryString);
     }
killedBy: AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminProductOverviewControllTest::testIfArrayIsSetUp
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/ProductRepository.php:

[Killed] MethodCallRemoval
Model/ProductRepository.php:91:9
     {
         $queryString = "DELETE FROM products ";
         $queryString .= "WHERE productId =" . $productId;
-        $this->pdo->query($queryString);
+        
     }
 
killedBy: AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
statusReason: 1) AppTest\Model\ProductRepositoryTest::testIfNewProductWillBeCreatedEditedAndDeleted
Failed asserting that App\Model\Dto\ProductsDataTransferObject Object &00000000000000f50000000000000000 (
    'productId' => 632
    'mainId' => 4
    'displayName' => 'Test'
    'productName' => 'test'
    'description' => 'editedTEST'
    'price' => '999'

[Survived] MethodCallRemoval
Model/ProductRepository.php:102:9
         string $price
     ): void {
-        $this->pdo->query($queryString);
+        
     }
 
