[Killed] PublicVisibility
Service/Container.php:16:5
     {
     }
 
-    public function set(string $class, object $newObject): void
+    protected function set(string $class, object $newObject) : void
     {
         $this->objects[$class] = $newObject;
killedBy: AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
Error: Call to protected method App\Service\Container::set() from scope App\Service\DependencyProvider

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:49
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateProductControllTe

[Killed] PublicVisibility
Service/Container.php:21:5
         $this->objects[$class] = $newObject;
     }
 
-    public function get(string $class)
+    protected function get(string $class)
     {
         return $this->objects[$class];
killedBy: AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
statusReason: 1) AppTest\Controller\BackendController\CreateProductControllTest::testIfArrayIsSetUp
Error: Call to protected method App\Service\Container::get() from scope App\Service\DependencyProvider

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:52
/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/CreateProductControllTe
