[Killed] PublicVisibility
Validation/UserDataValidation.php:20:5
     ) {
     }
 
-    public function checkIfNewUserNameIsValid(string $userName): bool
+    protected function checkIfNewUserNameIsValid(string $userName) : bool
     {
         $userNameValid = true;
killedBy: AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
statusReason: 1) AppTest\Controller\BackendController\CreateUserControllTest::testIfUserIsNotAdded
Error: Call to protected method App\Validation\UserDataValidation::checkIfNewUserNameIsValid() from scope App\Controller\BackendController\CreateUserControll

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendController/CreateUserControll.php:28
/home/jonathanhemmerling/PhpstormProject

[Killed] TrueValue
Validation/UserDataValidation.php:22:9
 
     public function checkIfNewUserNameIsValid(string $userName): bool
     {
-        $userNameValid = true;
+        $userNameValid = false;
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:25:13
         $userNameValid = true;
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
-            $userNameValid = false;
+            $userNameValid = true;
         } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:49

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Validation/UserDataValidation.php:26:9
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 21])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:53

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:26:9
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif ($this->has_length($userName, ['min' => 3, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:28:13
             $userNameValid = false;
         } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
-            $userNameValid = false;
+            $userNameValid = true;
         } elseif (!$this->isAUniqueUserName($userName)) {
             $this->errors[] = 'Select another Username';
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:52

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:29:9
         } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
-        } elseif (!$this->isAUniqueUserName($userName)) {
+        } elseif ($this->isAUniqueUserName($userName)) {
             $this->errors[] = 'Select another Username';
             $userNameValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:31:13
             $userNameValid = false;
         } elseif (!$this->isAUniqueUserName($userName)) {
             $this->errors[] = 'Select another Username';
-            $userNameValid = false;
+            $userNameValid = true;
         }
         return $userNameValid;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:54

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] TrueValue
Validation/UserDataValidation.php:39:9
     public function checkIfUserNameIsValid(
         string $userName
     ): bool {
-        $userNameValid = true;
+        $userNameValid = false;
         if ($this->is_blank($userName) || ((!$this->userNameExist($userName) && !$this->userAdminExist($userName)))) {
             $this->errors = [];
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Expectation failed for method name is "to" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:40:9
         string $userName
     ): bool {
         $userNameValid = true;
-        if ($this->is_blank($userName) || ((!$this->userNameExist($userName) && !$this->userAdminExist($userName)))) {
+        if ($this->is_blank($userName) || !$this->userNameExist($userName) && $this->userAdminExist($userName)) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] LogicalOr
Validation/UserDataValidation.php:40:9
         string $userName
     ): bool {
         $userNameValid = true;
-        if ($this->is_blank($userName) || ((!$this->userNameExist($userName) && !$this->userAdminExist($userName)))) {
+        if ($this->is_blank($userName) && (!$this->userNameExist($userName) && !$this->userAdminExist($userName))) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
killedBy: AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:66

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:43:13
         if ($this->is_blank($userName) || ((!$this->userNameExist($userName) && !$this->userAdminExist($userName)))) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
-            $userNameValid = false;
+            $userNameValid = true;
         }
         return $userNameValid;
killedBy: AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
statusReason: 1) AppTest\Controller\BackendController\LoginControllTest::testIsUserLoggedIn
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Controller/BackendController/LoginControllTest.php:84

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:53:9
         string $dbUserPassword
     ): bool {
         $passwordVerified = password_verify($userPassword, $dbUserPassword);
-        if (!$passwordVerified) {
+        if ($passwordVerified) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] PublicVisibility
Validation/UserDataValidation.php:60:5
         return $passwordVerified;
     }
 
-    public function checkIfPasswordIsValid(string $password, string $confirmPassword): bool
+    protected function checkIfPasswordIsValid(string $password, string $confirmPassword) : bool
     {
 
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Error: Call to protected method App\Validation\UserDataValidation::checkIfPasswordIsValid() from scope AppTest\Validation\UserDataValidationTest

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:72

ERRORS!
Tests: 3, Assertions: 13, Errors: 1.

[Killed] TrueValue
Validation/UserDataValidation.php:63:9
     public function checkIfPasswordIsValid(string $password, string $confirmPassword): bool
     {
 
-        $passwordValid = true;
+        $passwordValid = false;
         if (($this->is_blank($password) || $this->is_blank($confirmPassword))) {
             $this->errors[] = 'Password cannot be blank';
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:81

FAILURES!
Tests: 3, Assertions: 14, Failures: 1.

[Survived] LogicalOr
Validation/UserDataValidation.php:64:9
     {
 
         $passwordValid = true;
-        if (($this->is_blank($password) || $this->is_blank($confirmPassword))) {
+        if ($this->is_blank($password) && $this->is_blank($confirmPassword)) {
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;

[Survived] FalseValue
Validation/UserDataValidation.php:66:13
         $passwordValid = true;
         if (($this->is_blank($password) || $this->is_blank($confirmPassword))) {
             $this->errors[] = 'Password cannot be blank';
-            $passwordValid = false;
+            $passwordValid = true;
         }
         if (!$this->has_length($confirmPassword, ['min' => 8])) {

[Killed] IncrementInteger
Validation/UserDataValidation.php:68:9
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8])) {
+        if (!$this->has_length($confirmPassword, ['min' => 9])) {
             $this->errors[] = 'Password must be at least 8 characters long';
             $passwordValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:81

FAILURES!
Tests: 3, Assertions: 14, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:68:9
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8])) {
+        if ($this->has_length($confirmPassword, ['min' => 8])) {
             $this->errors[] = 'Password must be at least 8 characters long';
             $passwordValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:81

FAILURES!
Tests: 3, Assertions: 14, Failures: 1.

[Survived] FalseValue
Validation/UserDataValidation.php:70:13
         }
         if (!$this->has_length($confirmPassword, ['min' => 8])) {
             $this->errors[] = 'Password must be at least 8 characters long';
-            $passwordValid = false;
+            $passwordValid = true;
         }
         if (!password_verify($confirmPassword, $password)) {

[Killed] LogicalNot
Validation/UserDataValidation.php:72:9
             $this->errors[] = 'Password must be at least 8 characters long';
             $passwordValid = false;
         }
-        if (!password_verify($confirmPassword, $password)) {
+        if (password_verify($confirmPassword, $password)) {
             $this->errors[] = 'Passwords has to be the same';
             $passwordValid = false;
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:81

FAILURES!
Tests: 3, Assertions: 14, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:74:13
         }
         if (!password_verify($confirmPassword, $password)) {
             $this->errors[] = 'Passwords has to be the same';
-            $passwordValid = false;
+            $passwordValid = true;
         }
         return $passwordValid;
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:82

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.

[Killed] Identical
Validation/UserDataValidation.php:87:9
     private function is_blank(
         string $value
     ): bool {
-        return !isset($value) || trim($value) === '';
+        return !isset($value) || trim($value) !== '';
     }
 
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] LogicalNot
Validation/UserDataValidation.php:87:9
     private function is_blank(
         string $value
     ): bool {
-        return !isset($value) || trim($value) === '';
+        return isset($value) || trim($value) === '';
     }
 
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] GreaterThanNegotiation
Validation/UserDataValidation.php:95:9
         int $min
     ): bool {
         $length = strlen($value);
-        return $length > $min;
+        return $length <= $min;
     }
 
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThan
Validation/UserDataValidation.php:95:9
         int $min
     ): bool {
         $length = strlen($value);
-        return $length > $min;
+        return $length >= $min;
     }
 
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:52

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] LessThanNegotiation
Validation/UserDataValidation.php:103:9
         int $max
     ): bool {
         $length = strlen($value);
-        return $length < $max;
+        return $length >= $max;
     }
 
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThan
Validation/UserDataValidation.php:103:9
         int $max
     ): bool {
         $length = strlen($value);
-        return $length < $max;
+        return $length <= $max;
     }
 
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:53

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IncrementInteger
Validation/UserDataValidation.php:110:9
         string $value,
         array $options
     ): bool {
-        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
+        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 2)) {
             return false;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:52

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Validation/UserDataValidation.php:110:9
         string $value,
         array $options
     ): bool {
-        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
+        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 0)) {
             return false;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfPasswordIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:81

FAILURES!
Tests: 3, Assertions: 14, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:111:13
         array $options
     ): bool {
         if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
-            return false;
+            return true;
         }
         if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:52

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Plus
Validation/UserDataValidation.php:113:9
         if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
             return false;
         }
-        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
+        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] - 1)) {
             return false;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:51

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] LogicalAnd
Validation/UserDataValidation.php:113:9
         if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
             return false;
         }
-        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
+        if (isset($options['max']) || !$this->has_length_less_than($value, $options['max'] + 1)) {
             return false;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:114:13
             return false;
         }
         if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
-            return false;
+            return true;
         }
         return true;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:53

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:121:9
 
     private function isAUniqueUserName(string $userName): bool
     {
-        $userDataDontExist = false;
+        $userDataDontExist = true;
         $userDataExist = $this->repository->doesUserDataExists($userName);
         if (!$userDataExist) {
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:54

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] LogicalNot
Validation/UserDataValidation.php:123:9
     {
         $userDataDontExist = false;
         $userDataExist = $this->repository->doesUserDataExists($userName);
-        if (!$userDataExist) {
+        if ($userDataExist) {
             $userDataDontExist = true;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Validation/UserDataValidation.php:124:13
         $userDataDontExist = false;
         $userDataExist = $this->repository->doesUserDataExists($userName);
         if (!$userDataExist) {
-            $userDataDontExist = true;
+            $userDataDontExist = false;
         }
         return $userDataDontExist;
killedBy: AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfNewUserNameIsValid
Failed asserting that false is true.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Validation/UserDataValidation.php:132:9
     private function userNameExist(
         string $value
     ): bool {
-        $userDataExist = false;
+        $userDataExist = true;
         $userDataArray = $this->login->findUserByName($value);
         if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
killedBy: AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:66

FAILURES!
Tests: 7, Assertions: 23, Failures: 1.

[Killed] LogicalAnd
Validation/UserDataValidation.php:134:9
     ): bool {
         $userDataExist = false;
         $userDataArray = $this->login->findUserByName($value);
-        if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
+        if (isset($userDataArray['userName']) || $userDataArray['userName'] === $value) {
             $userDataExist = true;
         }
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Undefined array key "userName"

/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:106
/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:32
/home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/BackendContro

[Survived] Identical
Validation/UserDataValidation.php:134:9
     ): bool {
         $userDataExist = false;
         $userDataArray = $this->login->findUserByName($value);
-        if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
+        if (isset($userDataArray['userName']) && $userDataArray['userName'] !== $value) {
             $userDataExist = true;
         }

[Survived] TrueValue
Validation/UserDataValidation.php:135:13
         $userDataExist = false;
         $userDataArray = $this->login->findUserByName($value);
         if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
-            $userDataExist = true;
+            $userDataExist = false;
         }
         return $userDataExist;

[Killed] Identical
Validation/UserDataValidation.php:145:9
     ): bool {
         $userDataExist = false;
         $userDataArray = $this->login->findAdminByName($value);
-        if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
+        if (isset($userDataArray['userName']) && $userDataArray['userName'] !== $value) {
             $userDataExist = true;
         }
killedBy: AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
statusReason: 1) AppTest\Controller\BackendController\AdminLoginControllTest::testIfTemplateIsSetUp
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 (
-    'errors' => Array &1 ()
+    'errors' => Array &1 (

[Killed] LogicalAnd
Validation/UserDataValidation.php:145:9
     ): bool {
         $userDataExist = false;
         $userDataArray = $this->login->findAdminByName($value);
-        if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
+        if (isset($userDataArray['userName']) || $userDataArray['userName'] === $value) {
             $userDataExist = true;
         }
killedBy: AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
statusReason: 1) AppTest\Validation\UserDataValidationTest::testIfUserNameIsValid
Failed asserting that true is false.

/home/jonathanhemmerling/PhpstormProjects/shopix_project/tests/Validation/UserDataValidationTest.php:66

FAILURES!
Tests: 3, Assertions: 15, Failures: 1.
