1) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:40    [M] Identical

--- Original
+++ New
@@ @@
     {
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
-            if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
+            if ($this->pageId !== $name['categoryId'] && $this->productId === $name['id']) {
                 $this->strForProductName[] = $name['displayName'] . ':';
                 $this->strForProductDescription[] = $name['description'];
             }

2) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:40    [M] Identical

--- Original
+++ New
@@ @@
     {
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
-            if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
+            if ($this->pageId === $name['categoryId'] && $this->productId !== $name['id']) {
                 $this->strForProductName[] = $name['displayName'] . ':';
                 $this->strForProductDescription[] = $name['description'];
             }

3) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:40    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
-            if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
+            if ($this->pageId === $name['categoryId'] || $this->productId === $name['id']) {
                 $this->strForProductName[] = $name['displayName'] . ':';
                 $this->strForProductDescription[] = $name['description'];
             }

4) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:41    [M] Concat

--- Original
+++ New
@@ @@
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
             if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
-                $this->strForProductName[] = $name['displayName'] . ':';
+                $this->strForProductName[] = ':' . $name['displayName'];
                 $this->strForProductDescription[] = $name['description'];
             }
         }

5) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:41    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
             if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
-                $this->strForProductName[] = $name['displayName'] . ':';
+                $this->strForProductName[] = ':';
                 $this->strForProductDescription[] = $name['description'];
             }
         }

6) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:41    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $productName = $this->getProductDataFromModel();
         foreach ($productName as $name) {
             if ($this->pageId === $name['categoryId'] && $this->productId === $name['id']) {
-                $this->strForProductName[] = $name['displayName'] . ':';
+                $this->strForProductName[] = $name['displayName'];
                 $this->strForProductDescription[] = $name['description'];
             }
         }

7) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private function addProductNameParameterToView() : void
     {
         $this->getProductNameAsArray();
-        $this->view->addTemplateParameter('productHome', ['<a href="index.php">Home</a>']);
+        $this->view->addTemplateParameter('productHome', []);
         $productNameStrArray = $this->strForProductName;
         $this->view->addTemplateParameter('productName', $productNameStrArray);
         $productDescriptionStrArray = $this->strForProductDescription;

8) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function addProductNameParameterToView() : void
     {
         $this->getProductNameAsArray();
-        $this->view->addTemplateParameter('productHome', ['<a href="index.php">Home</a>']);
+        
         $productNameStrArray = $this->strForProductName;
         $this->view->addTemplateParameter('productName', $productNameStrArray);
         $productDescriptionStrArray = $this->strForProductDescription;

9) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->getProductNameAsArray();
         $this->view->addTemplateParameter('productHome', ['<a href="index.php">Home</a>']);
         $productNameStrArray = $this->strForProductName;
-        $this->view->addTemplateParameter('productName', $productNameStrArray);
+        
         $productDescriptionStrArray = $this->strForProductDescription;
         $this->view->addTemplateParameter('productDescription', $productDescriptionStrArray);
     }

10) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $productNameStrArray = $this->strForProductName;
         $this->view->addTemplateParameter('productName', $productNameStrArray);
         $productDescriptionStrArray = $this->strForProductDescription;
-        $this->view->addTemplateParameter('productDescription', $productDescriptionStrArray);
+        
     }
     public function renderView() : void
     {

11) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/DetailControll.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function renderView() : void
     {
-        $this->addProductNameParameterToView();
+        
         $this->view->renderTemplate('product.tpl');
     }
 }

12) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = $menuLink['category'] . 'index.php?page=List&' . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

13) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

14) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

15) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . '&productId=' . $menuLink['category'] . $menuLink['id'] . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

16) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . $menuLink['id'] . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

17) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . $menuLink['id'] . '&productId=' . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

18) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . '>' . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

19) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . '>' . $menuLink['id'] . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

20) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . $menuLink['displayName'];
         }
     }
     private function addParameterToView() : void

21) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . $menuLink['displayName'] . '>';
         }
     }
     private function addParameterToView() : void

22) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $menuContent = $this->getMenuDataFromModel();
         foreach ($menuContent as $menuLink) {
-            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>' . $menuLink['displayName'];
+            $this->strForMenuLinks[] = 'index.php?page=List&' . $menuLink['category'] . '&productId=' . $menuLink['id'] . '>';
         }
     }
     private function addParameterToView() : void

23) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->getMenuAsArr();
         $menuStrArray = $this->strForMenuLinks;
-        $this->view->addTemplateParameter('menu', $menuStrArray);
+        
     }
     public function renderView() : void
     {

24) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/HomeControll.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function renderView() : void
     {
-        $this->addParameterToView();
+        
         $this->view->renderTemplate('home.tpl');
     }
 }

25) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:35    [M] Identical

--- Original
+++ New
@@ @@
     {
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
-            if ($this->productId === $categoryLink['categoryId']) {
+            if ($this->productId !== $categoryLink['categoryId']) {
                 $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }

26) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = $categoryLink['detail'] . 'index.php?page=Detail&' . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

27) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

28) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

29) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . '&categoryId=' . $categoryLink['detail'] . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

30) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

31) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . $categoryLink['categoryId'] . '&categoryId=' . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

32) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

33) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . '&id=' . $categoryLink['categoryId'] . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

34) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . $categoryLink['id'] . '>' . $categoryLink['displayName'];
             }
         }
     }

35) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . $categoryLink['id'] . '&id=' . '>' . $categoryLink['displayName'];
             }
         }
     }

36) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . '>' . $categoryLink['displayName'];
             }
         }
     }

37) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . '>' . $categoryLink['id'] . $categoryLink['displayName'];
             }
         }
     }

38) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . $categoryLink['displayName'];
             }
         }
     }

39) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] Concat

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . $categoryLink['displayName'] . '>';
             }
         }
     }

40) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:36    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $categoryContent = $this->getProductDataFromModel();
         foreach ($categoryContent as $categoryLink) {
             if ($this->productId === $categoryLink['categoryId']) {
-                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>' . $categoryLink['displayName'];
+                $this->strForCategoryLinks[] = 'index.php?page=Detail&' . $categoryLink['detail'] . '&categoryId=' . $categoryLink['categoryId'] . '&id=' . $categoryLink['id'] . '>';
             }
         }
     }

41) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private function addCategoryParameterToView() : void
     {
         $this->getCategorysAsArr();
-        $this->view->addTemplateParameter('categoryHome', ['<a href="index.php">Home</a>']);
+        $this->view->addTemplateParameter('categoryHome', []);
         $categoryStrArray = $this->strForCategoryLinks;
         $this->view->addTemplateParameter('categoryLink', $categoryStrArray);
     }

42) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function addCategoryParameterToView() : void
     {
         $this->getCategorysAsArr();
-        $this->view->addTemplateParameter('categoryHome', ['<a href="index.php">Home</a>']);
+        
         $categoryStrArray = $this->strForCategoryLinks;
         $this->view->addTemplateParameter('categoryLink', $categoryStrArray);
     }

43) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->getCategorysAsArr();
         $this->view->addTemplateParameter('categoryHome', ['<a href="index.php">Home</a>']);
         $categoryStrArray = $this->strForCategoryLinks;
-        $this->view->addTemplateParameter('categoryLink', $categoryStrArray);
+        
     }
     public function renderView() : void
     {

44) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/ListControll.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function renderView() : void
     {
-        $this->addCategoryParameterToView();
+        
         $this->view->renderTemplate('category.tpl');
     }
 }

45) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/NotFoundControll.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function renderView() : void
     {
-        $this->view->addTemplateParameter('error', [$this->error]);
+        $this->view->addTemplateParameter('error', []);
         $this->view->renderTemplate('notFound.tpl');
     }
 }

46) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Controller/NotFoundControll.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function renderView() : void
     {
-        $this->view->addTemplateParameter('error', [$this->error]);
+        
         $this->view->renderTemplate('notFound.tpl');
     }
 }

47) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/MainMenu.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $jsonFile = file_get_contents($this->pathToJsonFile);
         try {
-            $mainMenuContent = json_decode($jsonFile, true, 512, JSON_THROW_ON_ERROR);
+            $mainMenuContent = json_decode($jsonFile, true, 511, JSON_THROW_ON_ERROR);
         } catch (JsonException $exception) {
             throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), 0, $exception);
         }

48) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/MainMenu.php:32    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $jsonFile = file_get_contents($this->pathToJsonFile);
         try {
-            $mainMenuContent = json_decode($jsonFile, true, 512, JSON_THROW_ON_ERROR);
+            $mainMenuContent = json_decode($jsonFile, true, 513, JSON_THROW_ON_ERROR);
         } catch (JsonException $exception) {
             throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), 0, $exception);
         }
