49) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/MainMenu.php:34    [M] DecrementInteger

--- Original
+++ New
@@ @@
         try {
             $mainMenuContent = json_decode($jsonFile, true, 512, JSON_THROW_ON_ERROR);
         } catch (JsonException $exception) {
-            throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), 0, $exception);
+            throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), -1, $exception);
         }
         return $mainMenuContent;
     }
 }

50) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/MainMenu.php:34    [M] IncrementInteger

--- Original
+++ New
@@ @@
         try {
             $mainMenuContent = json_decode($jsonFile, true, 512, JSON_THROW_ON_ERROR);
         } catch (JsonException $exception) {
-            throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), 0, $exception);
+            throw new RuntimeException(sprintf('Invalid JSON stored in file "%s".', $this->pathToJsonFile), 1, $exception);
         }
         return $mainMenuContent;
     }
 }

55) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/ControllerProvider.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function getList() : array
     {
-        return [DetailControll::class, HomeControll::class, ListControll::class, NotFoundControll::class];
+        return [HomeControll::class, ListControll::class, NotFoundControll::class];
     }
     public function getClassByString(string $pageTitle) : string
     {


Timed Out mutants:
==================
