5) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function doesUserDataExists(string $user) : bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString .= $user . '";';
         if (!$queryString) {
             return false;
         }

7) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:44    [M] Concat

--- Original
+++ New
@@ @@
     public function doesUserDataExists(string $user) : bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString .= "userName=\"" . '";' . $user;
         if (!$queryString) {
             return false;
         }

8) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function doesUserDataExists(string $user) : bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString .= "userName=\"" . $user;
         if (!$queryString) {
             return false;
         }

9) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Model/UserRepository.php:44    [M] Assignment

--- Original
+++ New
@@ @@
     public function doesUserDataExists(string $user) : bool
     {
         $queryString = "SELECT * FROM userData WHERE ";
-        $queryString .= "userName=\"" . $user . '";';
+        $queryString = "userName=\"" . $user . '";';
         if (!$queryString) {
             return false;
         }

10) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(Session::class, new Session());
         $container->set(UserDataMapper::class, new UserDataMapper());
         $container->set(ProductsMapper::class, new ProductsMapper());
-        $container->set(SubMenuMapper::class, new SubMenuMapper());
+        
         $container->set(MainMenuMapper::class, new MainMenuMapper());
         $container->set(LoginRepository::class, new LoginRepository($container->get(SqlConnection::class), $container->get(PDO::class)));
         $container->set(ProductRepository::class, new ProductRepository($container->get(SqlConnection::class), $container->get(PDO::class), $container->get(ProductsMapper::class), $container->get(MainMenuMapper::class)));

11) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(ProductRepository::class, new ProductRepository($container->get(SqlConnection::class), $container->get(PDO::class), $container->get(ProductsMapper::class), $container->get(MainMenuMapper::class)));
         $container->set(UserRepository::class, new UserRepository($container->get(SqlConnection::class), $container->get(UserDataMapper::class)));
         $container->set(UserDataValidation::class, new UserDataValidation($container->get(LoginRepository::class), $container->get(UserRepository::class)));
-        $container->set(AdminControll::class, new AdminControll($container->get(View::class)));
+        
         $container->set(AdminLoginControll::class, new AdminLoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));

12) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(UserRepository::class, new UserRepository($container->get(SqlConnection::class), $container->get(UserDataMapper::class)));
         $container->set(UserDataValidation::class, new UserDataValidation($container->get(LoginRepository::class), $container->get(UserRepository::class)));
         $container->set(AdminControll::class, new AdminControll($container->get(View::class)));
-        $container->set(AdminLoginControll::class, new AdminLoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
+        
         $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));

13) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(UserDataValidation::class, new UserDataValidation($container->get(LoginRepository::class), $container->get(UserRepository::class)));
         $container->set(AdminControll::class, new AdminControll($container->get(View::class)));
         $container->set(AdminLoginControll::class, new AdminLoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
-        $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
+        
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));

14) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:96    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(AdminControll::class, new AdminControll($container->get(View::class)));
         $container->set(AdminLoginControll::class, new AdminLoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
-        $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
+        
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));

15) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:104    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(AdminLoginControll::class, new AdminLoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
-        $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
+        
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));

16) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:113    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(AdminLogoutControll::class, new AdminLogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
-        $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
+        
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));

17) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:121    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(CategoryDataControll::class, new CategoryDataControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
-        $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
+        
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));

18) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:128    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(ChangeUserDataControll::class, new ChangeUserDataControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class), $container->get(Redirect::class)));
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
-        $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
+        
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));

19) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:129    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(CreateProductControll::class, new CreateProductControll($container->get(View::class), $container->get(ProductRepository::class), $container->get(Redirect::class)));
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
-        $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
+        
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));

20) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:136    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(DetailControll::class, new DetailControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
-        $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
+        
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));

21) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:143    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(DetailDataControll::class, new DetailDataControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
-        $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
+        
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
         $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));

22) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:153    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(HomeControll::class, new HomeControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
-        $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
+        
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
         $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));
         $container->set(UserDetailControll::class, new UserDetailControll($container->get(View::class), $container->get(UserRepository::class)));

23) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:157    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(ListControll::class, new ListControll($container->get(View::class), $container->get(ProductRepository::class)));
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
-        $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
+        
         $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));
         $container->set(UserDetailControll::class, new UserDetailControll($container->get(View::class), $container->get(UserRepository::class)));
         $container->set(UserOverviewControll::class, new UserOverviewControll($container->get(View::class), $container->get(UserRepository::class), $container->get(Redirect::class)));
     }
 }

24) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:163    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(LoginControll::class, new LoginControll($container->get(View::class), $container->get(LoginRepository::class), $container->get(UserDataValidation::class), $container->get(Session::class), $container->get(Redirect::class)));
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
-        $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));
+        
         $container->set(UserDetailControll::class, new UserDetailControll($container->get(View::class), $container->get(UserRepository::class)));
         $container->set(UserOverviewControll::class, new UserOverviewControll($container->get(View::class), $container->get(UserRepository::class), $container->get(Redirect::class)));
     }
 }

25) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:171    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(LogoutControll::class, new LogoutControll($container->get(View::class), $container->get(Session::class)));
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
         $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));
-        $container->set(UserDetailControll::class, new UserDetailControll($container->get(View::class), $container->get(UserRepository::class)));
+        
         $container->set(UserOverviewControll::class, new UserOverviewControll($container->get(View::class), $container->get(UserRepository::class), $container->get(Redirect::class)));
     }
 }

26) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Service/DependencyProvider.php:175    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $container->set(NotFoundControll::class, new NotFoundControll($container->get(View::class)));
         $container->set(UserControll::class, new UserControll($container->get(View::class), $container->get(UserRepository::class), $container->get(UserDataValidation::class)));
         $container->set(UserDetailControll::class, new UserDetailControll($container->get(View::class), $container->get(UserRepository::class)));
-        $container->set(UserOverviewControll::class, new UserOverviewControll($container->get(View::class), $container->get(UserRepository::class), $container->get(Redirect::class)));
+        
     }
 }

27) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:26    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     }
     private function is_blank(string $value) : bool
     {
-        return !isset($value) || trim($value) === '';
+        return !isset($value) || $value === '';
     }
     private function has_length_greater_than(string $value, int $min) : bool
     {

28) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:26    [M] LogicalOr

--- Original
+++ New
@@ @@
     }
     private function is_blank(string $value) : bool
     {
-        return !isset($value) || trim($value) === '';
+        return !isset($value) && trim($value) === '';
     }
     private function has_length_greater_than(string $value, int $min) : bool
     {

31) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:61    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function has_length(string $value, array $options) : bool
     {
-        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
+        if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 2)) {
             return false;
         }
         if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {

32) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:64    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
             return false;
         }
-        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
+        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 0)) {
             return false;
         }
         if (isset($options['exact']) && !$this->has_length_exactly($value, $options['exact'])) {

33) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:64    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (isset($options['min']) && !$this->has_length_greater_than($value, $options['min'] - 1)) {
             return false;
         }
-        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
+        if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 2)) {
             return false;
         }
         if (isset($options['exact']) && !$this->has_length_exactly($value, $options['exact'])) {

35) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:68    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (isset($options['max']) && !$this->has_length_less_than($value, $options['max'] + 1)) {
             return false;
         }
-        if (isset($options['exact']) && !$this->has_length_exactly($value, $options['exact'])) {
+        if (isset($options['exact']) && $this->has_length_exactly($value, $options['exact'])) {
             return false;
         } else {
             return true;

36) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:85    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $userDataDontExist;
     }
-    public function userNameExist(string $value) : bool
+    protected function userNameExist(string $value) : bool
     {
         $userDataExist = false;
         $userDataArray = $this->login->findUserByName($value);

37) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:89    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public function userNameExist(string $value) : bool
     {
-        $userDataExist = false;
+        $userDataExist = true;
         $userDataArray = $this->login->findUserByName($value);
         if (isset($userDataArray['userName']) && $userDataArray['userName'] === $value) {
             $userDataExist = true;

40) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:97    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $userDataExist;
     }
-    public function userAdminExist(string $value) : bool
+    protected function userAdminExist(string $value) : bool
     {
         $userDataExist = false;
         $userDataArray = $this->login->findAdminByName($value);

44) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:115    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif (!$this->has_length($userName, ['min' => 2, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
         } elseif (!$this->isAUniqueUserName($userName)) {

45) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:115    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif (!$this->has_length($userName, ['min' => 4, 'max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
         } elseif (!$this->isAUniqueUserName($userName)) {

46) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:115    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 19])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
         } elseif (!$this->isAUniqueUserName($userName)) {
