48) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:115    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ($this->is_blank($userName)) {
             $this->errors[] = 'Username cannot be blank';
             $userNameValid = false;
-        } elseif (!$this->has_length($userName, ['min' => 3, 'max' => 20])) {
+        } elseif (!$this->has_length($userName, ['max' => 20])) {
             $this->errors[] = 'Username must be between 3 and 20 characters long';
             $userNameValid = false;
         } elseif (!$this->isAUniqueUserName($userName)) {

50) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:130    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function checkIfUserNameIsValid(string $userName) : bool
     {
         $userNameValid = true;
-        if ($this->is_blank($userName) || !$this->userNameExist($userName) && !$this->userAdminExist($userName)) {
+        if ($this->is_blank($userName) || $this->userNameExist($userName) && !$this->userAdminExist($userName)) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
             $userNameValid = false;

51) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:130    [M] LogicalOr

--- Original
+++ New
@@ @@
     public function checkIfUserNameIsValid(string $userName) : bool
     {
         $userNameValid = true;
-        if ($this->is_blank($userName) || !$this->userNameExist($userName) && !$this->userAdminExist($userName)) {
+        if ($this->is_blank($userName) && (!$this->userNameExist($userName) && !$this->userAdminExist($userName))) {
             $this->errors = [];
             $this->errors[] = 'Invalid Userdata!';
             $userNameValid = false;

52) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:152    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     public function checkIfPasswordIsValid(string $password, string $confirmPassword)
     {
-        $passwordValid = true;
+        $passwordValid = false;
         if ($this->is_blank($password) || $this->is_blank($confirmPassword)) {
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;

53) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:153    [M] LogicalOr

--- Original
+++ New
@@ @@
     public function checkIfPasswordIsValid(string $password, string $confirmPassword)
     {
         $passwordValid = true;
-        if ($this->is_blank($password) || $this->is_blank($confirmPassword)) {
+        if ($this->is_blank($password) && $this->is_blank($confirmPassword)) {
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }

54) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:157    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 40])) {
+        if (!$this->has_length($confirmPassword, ['min' => 7, 'max' => 40])) {
             $this->errors[] = 'Password must be between 8 and 40 characters long';
             $passwordValid = false;
         }

55) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:157    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 40])) {
+        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 39])) {
             $this->errors[] = 'Password must be between 8 and 40 characters long';
             $passwordValid = false;
         }

56) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:157    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 40])) {
+        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 41])) {
             $this->errors[] = 'Password must be between 8 and 40 characters long';
             $passwordValid = false;
         }

57) /home/jonathanhemmerling/PhpstormProjects/shopix_project/src/Validation/UserDataValidation.php:157    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->errors[] = 'Password cannot be blank';
             $passwordValid = false;
         }
-        if (!$this->has_length($confirmPassword, ['min' => 8, 'max' => 40])) {
+        if (!$this->has_length($confirmPassword, ['max' => 40])) {
             $this->errors[] = 'Password must be between 8 and 40 characters long';
             $passwordValid = false;
         }


Timed Out mutants:
==================
